(function(r){const data={
  "version": 2,
  "origin": "玖波",
  "stations": {
    "新山口": {
      "id": "新山口",
      "name": "新山口",
      "reading": "しんやまぐち",
      "x": -1739,
      "y": 1872
    },
    "四辻": {
      "id": "四辻",
      "name": "四辻",
      "reading": "よつつじ",
      "x": -1504,
      "y": 1948
    },
    "大道": {
      "id": "大道",
      "name": "大道",
      "reading": "だいどう",
      "x": -1317,
      "y": 2096
    },
    "防府": {
      "id": "防府",
      "name": "防府",
      "reading": "ほうふ",
      "x": -947,
      "y": 2097
    },
    "富海": {
      "id": "富海",
      "name": "富海",
      "reading": "とのみ",
      "x": -626,
      "y": 2123
    },
    "戸田": {
      "id": "戸田",
      "name": "戸田",
      "reading": "へた",
      "x": -325,
      "y": 1989
    },
    "福川": {
      "id": "福川",
      "name": "福川",
      "reading": "ふくがわ",
      "x": -169,
      "y": 1992
    },
    "新南陽": {
      "id": "新南陽",
      "name": "新南陽",
      "reading": "しんなんよう",
      "x": -25,
      "y": 2006
    },
    "徳山": {
      "id": "徳山",
      "name": "徳山",
      "reading": "とくやま",
      "say": "徳山",
      "x": 124,
      "y": 2108
    },
    "櫛ケ浜": {
      "id": "櫛ケ浜",
      "name": "櫛ケ浜",
      "reading": "くしがはま",
      "x": 247,
      "y": 2220
    },
    "下松": {
      "id": "下松",
      "name": "下松",
      "reading": "くだまつ",
      "x": 426,
      "y": 2342
    },
    "光": {
      "id": "光",
      "name": "光",
      "reading": "ひかり",
      "x": 640,
      "y": 2536
    },
    "島田": {
      "id": "島田",
      "name": "島田",
      "reading": "しまた",
      "x": 852,
      "y": 2445
    },
    "岩田": {
      "id": "岩田",
      "name": "岩田",
      "reading": "いわた",
      "x": 1009,
      "y": 2492
    },
    "田布施": {
      "id": "田布施",
      "name": "田布施",
      "reading": "たぶせ",
      "x": 1234,
      "y": 2621
    },
    "柳井": {
      "id": "柳井",
      "name": "柳井",
      "reading": "やない",
      "x": 1520,
      "y": 2582
    },
    "柳井港": {
      "id": "柳井港",
      "name": "柳井港",
      "reading": "やないみなと",
      "x": 1650,
      "y": 2623
    },
    "大畠": {
      "id": "大畠",
      "name": "大畠",
      "reading": "おおばたけ",
      "x": 1864,
      "y": 2597
    },
    "神代": {
      "id": "神代",
      "name": "神代",
      "reading": "こうじろ",
      "x": 1993,
      "y": 2399
    },
    "由宇": {
      "id": "由宇",
      "name": "由宇",
      "reading": "ゆう",
      "x": 2013,
      "y": 2151
    },
    "通津": {
      "id": "通津",
      "name": "通津",
      "reading": "つづ",
      "x": 1973,
      "y": 2014
    },
    "藤生": {
      "id": "藤生",
      "name": "藤生",
      "reading": "ふじゅう",
      "x": 1944,
      "y": 1767
    },
    "南岩国": {
      "id": "南岩国",
      "name": "南岩国",
      "reading": "みなみいわくに",
      "x": 1978,
      "y": 1642
    },
    "岩国": {
      "id": "岩国",
      "name": "岩国",
      "reading": "いわくに",
      "x": 2068,
      "y": 1439
    },
    "和木": {
      "id": "和木",
      "name": "和木",
      "reading": "わき",
      "x": 2078,
      "y": 1260
    },
    "大竹": {
      "id": "大竹",
      "name": "大竹",
      "reading": "おおたけ",
      "x": 2058,
      "y": 1184
    },
    "玖波": {
      "id": "玖波",
      "name": "玖波",
      "reading": "くば",
      "x": 2080,
      "y": 975
    },
    "大野浦": {
      "id": "大野浦",
      "name": "大野浦",
      "reading": "おおのうら",
      "x": 2251,
      "y": 819
    },
    "前空": {
      "id": "前空",
      "name": "前空",
      "reading": "まえぞら",
      "x": 2361,
      "y": 721
    },
    "宮島口": {
      "id": "宮島口",
      "name": "宮島口",
      "reading": "みやじまぐち",
      "x": 2422,
      "y": 660
    },
    "阿品": {
      "id": "阿品",
      "name": "阿品",
      "reading": "あじな",
      "x": 2476,
      "y": 597
    },
    "宮内串戸": {
      "id": "宮内串戸",
      "name": "宮内串戸",
      "reading": "みやうちくしど",
      "x": 2520,
      "y": 457
    },
    "廿日市": {
      "id": "廿日市",
      "name": "廿日市",
      "reading": "はつかいち",
      "say": "ハツカイチ",
      "x": 2573,
      "y": 406
    },
    "五日市": {
      "id": "五日市",
      "name": "五日市",
      "reading": "いつかいち",
      "x": 2721,
      "y": 357
    },
    "新井口": {
      "id": "新井口",
      "name": "新井口",
      "reading": "しんいのくち",
      "x": 2829,
      "y": 310
    },
    "西広島": {
      "id": "西広島",
      "name": "西広島",
      "reading": "にしひろしま",
      "x": 2998,
      "y": 183
    },
    "横川": {
      "id": "横川",
      "name": "横川",
      "reading": "よこがわ",
      "x": 3101,
      "y": 115
    },
    "新白島": {
      "id": "新白島",
      "name": "新白島",
      "reading": "しんはくしま",
      "x": 3149,
      "y": 126
    },
    "広島": {
      "id": "広島",
      "name": "広島",
      "reading": "ひろしま",
      "x": 3216,
      "y": 186
    },
    "天神川": {
      "id": "天神川",
      "name": "天神川",
      "reading": "てんじんがわ",
      "x": 3317,
      "y": 230
    },
    "向洋": {
      "id": "向洋",
      "name": "向洋",
      "reading": "むかいなだ",
      "x": 3356,
      "y": 301
    },
    "海田市": {
      "id": "海田市",
      "name": "海田市",
      "reading": "かいたいち",
      "x": 3469,
      "y": 329
    },
    "安芸中野": {
      "id": "安芸中野",
      "name": "安芸中野",
      "reading": "あきなかの",
      "x": 3619,
      "y": 223
    },
    "中野東": {
      "id": "中野東",
      "name": "中野東",
      "reading": "なかのひがし",
      "x": 3690,
      "y": 154
    },
    "瀬野": {
      "id": "瀬野",
      "name": "瀬野",
      "reading": "せの",
      "x": 3773,
      "y": 51
    },
    "八本松": {
      "id": "八本松",
      "name": "八本松",
      "reading": "はちほんまつ",
      "x": 4194,
      "y": -80
    },
    "寺家": {
      "id": "寺家",
      "name": "寺家",
      "reading": "じけ",
      "x": 4351,
      "y": -46
    },
    "西条": {
      "id": "西条",
      "name": "西条",
      "reading": "さいじょう",
      "x": 4447,
      "y": -1
    },
    "西高屋": {
      "id": "西高屋",
      "name": "西高屋",
      "reading": "にしたかや",
      "x": 4652,
      "y": -84
    },
    "白市": {
      "id": "白市",
      "name": "白市",
      "reading": "しらいち",
      "x": 4853,
      "y": -67
    },
    "入野": {
      "id": "入野",
      "name": "入野",
      "reading": "にゅうの",
      "x": 4943,
      "y": -164
    },
    "河内": {
      "id": "河内",
      "name": "河内",
      "reading": "こうち",
      "x": 5115,
      "y": -213
    },
    "本郷": {
      "id": "本郷",
      "name": "本郷",
      "reading": "ほんごう",
      "say": "本郷",
      "x": 5567,
      "y": 120
    },
    "三原": {
      "id": "三原",
      "name": "三原",
      "reading": "みはら",
      "x": 6005,
      "y": 169
    },
    "三滝": {
      "id": "三滝",
      "name": "三滝",
      "reading": "みたき",
      "x": 3087,
      "y": 77
    },
    "安芸長束": {
      "id": "安芸長束",
      "name": "安芸長束",
      "reading": "あきながつか",
      "x": 3127,
      "y": 15
    },
    "下祇園": {
      "id": "下祇園",
      "name": "下祇園",
      "reading": "しもぎおん",
      "x": 3155,
      "y": -46
    },
    "古市橋": {
      "id": "古市橋",
      "name": "古市橋",
      "reading": "ふるいちばし",
      "x": 3182,
      "y": -108
    },
    "大町": {
      "id": "大町",
      "name": "大町",
      "reading": "おおまち",
      "x": 3194,
      "y": -168
    },
    "緑井": {
      "id": "緑井",
      "name": "緑井",
      "reading": "みどりい",
      "x": 3217,
      "y": -201
    },
    "七軒茶屋": {
      "id": "七軒茶屋",
      "name": "七軒茶屋",
      "reading": "しちけんぢゃや",
      "x": 3242,
      "y": -230
    },
    "梅林": {
      "id": "梅林",
      "name": "梅林",
      "reading": "ばいりん",
      "x": 3301,
      "y": -275
    },
    "上八木": {
      "id": "上八木",
      "name": "上八木",
      "reading": "かみやぎ",
      "x": 3359,
      "y": -329
    },
    "中島": {
      "id": "中島",
      "name": "中島",
      "reading": "なかしま",
      "x": 3389,
      "y": -384
    },
    "可部": {
      "id": "可部",
      "name": "可部",
      "reading": "かべ",
      "x": 3378,
      "y": -448
    },
    "河戸帆待川": {
      "id": "河戸帆待川",
      "name": "河戸帆待川",
      "reading": "こうどほまちがわ",
      "x": 3352,
      "y": -474
    },
    "あき亀山": {
      "id": "あき亀山",
      "name": "あき亀山",
      "reading": "あきかめやま",
      "x": 3311,
      "y": -477
    },
    "矢野": {
      "id": "矢野",
      "name": "矢野",
      "reading": "やの",
      "x": 3476,
      "y": 438
    },
    "坂": {
      "id": "坂",
      "name": "坂",
      "reading": "さか",
      "x": 3379,
      "y": 512
    },
    "水尻": {
      "id": "水尻",
      "name": "水尻",
      "reading": "みずしり",
      "x": 3324,
      "y": 617
    },
    "小屋浦": {
      "id": "小屋浦",
      "name": "小屋浦",
      "reading": "こやうら",
      "x": 3358,
      "y": 715
    },
    "呉ポートピア": {
      "id": "呉ポートピア",
      "name": "呉ポートピア",
      "reading": "くれぽーとぴあ",
      "x": 3388,
      "y": 773
    },
    "天応": {
      "id": "天応",
      "name": "天応",
      "reading": "てんのう",
      "x": 3419,
      "y": 832
    },
    "かるが浜": {
      "id": "かるが浜",
      "name": "かるが浜",
      "reading": "かるがはま",
      "x": 3407,
      "y": 926
    },
    "吉浦": {
      "id": "吉浦",
      "name": "吉浦",
      "reading": "よしうら",
      "x": 3453,
      "y": 962
    },
    "川原石": {
      "id": "川原石",
      "name": "川原石",
      "reading": "かわらいし",
      "x": 3517,
      "y": 1012
    },
    "呉": {
      "id": "呉",
      "name": "呉",
      "reading": "くれ",
      "x": 3593,
      "y": 1035
    },
    "安芸阿賀": {
      "id": "安芸阿賀",
      "name": "安芸阿賀",
      "reading": "あきあが",
      "x": 3791,
      "y": 1086
    },
    "新広": {
      "id": "新広",
      "name": "新広",
      "reading": "しんひろ",
      "x": 3854,
      "y": 1105
    },
    "広": {
      "id": "広",
      "name": "広",
      "reading": "ひろ",
      "x": 3922,
      "y": 1126
    },
    "仁方": {
      "id": "仁方",
      "name": "仁方",
      "reading": "にがた",
      "x": 4041,
      "y": 1163
    },
    "安芸川尻": {
      "id": "安芸川尻",
      "name": "安芸川尻",
      "reading": "あきかわじり",
      "x": 4207,
      "y": 1104
    },
    "安登": {
      "id": "安登",
      "name": "安登",
      "reading": "あと",
      "x": 4351,
      "y": 981
    },
    "安浦": {
      "id": "安浦",
      "name": "安浦",
      "reading": "やすうら",
      "x": 4451,
      "y": 817
    },
    "風早": {
      "id": "風早",
      "name": "風早",
      "reading": "かざはや",
      "x": 4686,
      "y": 710
    },
    "安芸津": {
      "id": "安芸津",
      "name": "安芸津",
      "reading": "あきつ",
      "x": 4790,
      "y": 628
    },
    "吉名": {
      "id": "吉名",
      "name": "吉名",
      "reading": "よしな",
      "x": 5008,
      "y": 613
    },
    "竹原": {
      "id": "竹原",
      "name": "竹原",
      "reading": "たけはら",
      "x": 5216,
      "y": 509
    },
    "大乗": {
      "id": "大乗",
      "name": "大乗",
      "reading": "おおのり",
      "x": 5373,
      "y": 502
    },
    "安芸長浜": {
      "id": "安芸長浜",
      "name": "安芸長浜",
      "reading": "あきながはま",
      "x": 5453,
      "y": 518
    },
    "忠海": {
      "id": "忠海",
      "name": "忠海",
      "reading": "ただのうみ",
      "x": 5584,
      "y": 524
    },
    "安芸幸崎": {
      "id": "安芸幸崎",
      "name": "安芸幸崎",
      "reading": "あきさいざき",
      "x": 5809,
      "y": 516
    },
    "須波": {
      "id": "須波",
      "name": "須波",
      "reading": "すなみ",
      "x": 6009,
      "y": 338
    },
    "矢賀": {
      "id": "矢賀",
      "name": "矢賀",
      "reading": "やが",
      "x": 3318,
      "y": 178
    },
    "戸坂": {
      "id": "戸坂",
      "name": "戸坂",
      "reading": "へさか",
      "x": 3288,
      "y": -41
    },
    "安芸矢口": {
      "id": "安芸矢口",
      "name": "安芸矢口",
      "reading": "あきやぐち",
      "x": 3306,
      "y": -180
    },
    "玖村": {
      "id": "玖村",
      "name": "玖村",
      "reading": "くむら",
      "x": 3365,
      "y": -282
    },
    "下深川": {
      "id": "下深川",
      "name": "下深川",
      "reading": "しもふかわ",
      "x": 3442,
      "y": -319
    },
    "西岩国": {
      "id": "西岩国",
      "name": "西岩国",
      "reading": "にしいわくに",
      "x": 1931,
      "y": 1488
    },
    "川西": {
      "id": "川西",
      "name": "川西",
      "reading": "かわにし",
      "x": 1846,
      "y": 1523
    },
    "柱野": {
      "id": "柱野",
      "name": "柱野",
      "reading": "はしらの",
      "x": 1742,
      "y": 1594
    },
    "欽明路": {
      "id": "欽明路",
      "name": "欽明路",
      "reading": "きんめいじ",
      "x": 1500,
      "y": 1813
    },
    "玖珂": {
      "id": "玖珂",
      "name": "玖珂",
      "reading": "くが",
      "x": 1408,
      "y": 1853
    },
    "周防高森": {
      "id": "周防高森",
      "name": "周防高森",
      "reading": "すおうたかもり",
      "x": 1241,
      "y": 1889
    },
    "米川": {
      "id": "米川",
      "name": "米川",
      "reading": "よねかわ",
      "x": 1101,
      "y": 1978
    },
    "高水": {
      "id": "高水",
      "name": "高水",
      "reading": "たかみず",
      "x": 908,
      "y": 2084
    },
    "勝間": {
      "id": "勝間",
      "name": "勝間",
      "reading": "かつま",
      "x": 822,
      "y": 2159
    },
    "大河内": {
      "id": "大河内",
      "name": "大河内",
      "reading": "おおかわち",
      "x": 730,
      "y": 2219
    },
    "周防久保": {
      "id": "周防久保",
      "name": "周防久保",
      "reading": "すおうくぼ",
      "say": "周防久保",
      "x": 660,
      "y": 2230
    },
    "生野屋": {
      "id": "生野屋",
      "name": "生野屋",
      "reading": "いくのや",
      "x": 515,
      "y": 2195
    },
    "周防花岡": {
      "id": "周防花岡",
      "name": "周防花岡",
      "reading": "すおうはなおか",
      "say": "周防花岡",
      "x": 424,
      "y": 2193
    },
    "清流新岩国": {
      "id": "清流新岩国",
      "name": "清流新岩国",
      "reading": "せいりゅうしんいわくに",
      "x": 1710,
      "y": 1490,
      "label": {
        "dx": -22,
        "dy": 34,
        "anchor": "end"
      }
    },
    "守内かさ神": {
      "id": "守内かさ神",
      "name": "守内かさ神",
      "reading": "しゅうちかさがみ",
      "x": 1653,
      "y": 1447
    },
    "南河内": {
      "id": "南河内",
      "name": "南河内",
      "reading": "みなみごうち",
      "x": 1507,
      "y": 1471
    },
    "行波": {
      "id": "行波",
      "name": "行波",
      "reading": "ゆかば",
      "x": 1432,
      "y": 1486
    },
    "北河内": {
      "id": "北河内",
      "name": "北河内",
      "reading": "きたごうち",
      "x": 1329,
      "y": 1416
    },
    "椋野": {
      "id": "椋野",
      "name": "椋野",
      "reading": "むくの",
      "x": 1186,
      "y": 1317
    },
    "南桑": {
      "id": "南桑",
      "name": "南桑",
      "reading": "なぐわ",
      "x": 1128,
      "y": 1230
    },
    "根笠": {
      "id": "根笠",
      "name": "根笠",
      "reading": "ねかさ",
      "x": 1026,
      "y": 1224
    },
    "河山": {
      "id": "河山",
      "name": "河山",
      "reading": "かわやま",
      "x": 958,
      "y": 1081
    },
    "柳瀬": {
      "id": "柳瀬",
      "name": "柳瀬",
      "reading": "やなぜ",
      "x": 925,
      "y": 964
    },
    "錦町": {
      "id": "錦町",
      "name": "錦町",
      "reading": "にしきちょう",
      "x": 862,
      "y": 923
    },
    "糸崎": {
      "id": "糸崎",
      "name": "糸崎",
      "reading": "いとざき",
      "x": 6107,
      "y": 219
    },
    "尾道": {
      "id": "尾道",
      "name": "尾道",
      "reading": "おのみち",
      "x": 6511,
      "y": 146
    },
    "東尾道": {
      "id": "東尾道",
      "name": "東尾道",
      "reading": "ひがしおのみち",
      "x": 6696,
      "y": -22
    },
    "松永": {
      "id": "松永",
      "name": "松永",
      "reading": "まつなが",
      "x": 6814,
      "y": -110
    },
    "備後赤坂": {
      "id": "備後赤坂",
      "name": "備後赤坂",
      "reading": "びんごあかさか",
      "x": 7031,
      "y": -228
    },
    "福山": {
      "id": "福山",
      "name": "福山",
      "reading": "ふくやま",
      "x": 7284,
      "y": -322
    },
    "東福山": {
      "id": "東福山",
      "name": "東福山",
      "reading": "ひがしふくやま",
      "x": 7492,
      "y": -356
    },
    "大門": {
      "id": "大門",
      "name": "大門",
      "reading": "だいもん",
      "x": 7646,
      "y": -372
    },
    "笠岡": {
      "id": "笠岡",
      "name": "笠岡",
      "reading": "かさおか",
      "x": 7942,
      "y": -409
    },
    "里庄": {
      "id": "里庄",
      "name": "里庄",
      "reading": "さとしょう",
      "x": 8153,
      "y": -425
    },
    "鴨方": {
      "id": "鴨方",
      "name": "鴨方",
      "reading": "かもがた",
      "x": 8324,
      "y": -533
    },
    "金光": {
      "id": "金光",
      "name": "金光",
      "reading": "こんこう",
      "x": 8477,
      "y": -609
    },
    "新倉敷": {
      "id": "新倉敷",
      "name": "新倉敷",
      "reading": "しんくらしき",
      "x": 8741,
      "y": -742
    },
    "西阿知": {
      "id": "西阿知",
      "name": "西阿知",
      "reading": "にしあち",
      "x": 8968,
      "y": -858
    },
    "倉敷": {
      "id": "倉敷",
      "name": "倉敷",
      "reading": "くらしき",
      "x": 9140,
      "y": -946
    },
    "中庄": {
      "id": "中庄",
      "name": "中庄",
      "reading": "なかしょう",
      "x": 9336,
      "y": -1083
    },
    "庭瀬": {
      "id": "庭瀬",
      "name": "庭瀬",
      "reading": "にわせ",
      "x": 9548,
      "y": -1174
    },
    "北長瀬": {
      "id": "北長瀬",
      "name": "北長瀬",
      "reading": "きたながせ",
      "x": 9689,
      "y": -1230
    },
    "岡山": {
      "id": "岡山",
      "name": "岡山",
      "reading": "おかやま",
      "x": 9841,
      "y": -1306
    },
    "大元": {
      "id": "大元",
      "name": "大元",
      "reading": "おおもと",
      "x": 9808,
      "y": -1199
    },
    "備前西市": {
      "id": "備前西市",
      "name": "備前西市",
      "reading": "びぜんにしいち",
      "x": 9757,
      "y": -1111
    },
    "妹尾": {
      "id": "妹尾",
      "name": "妹尾",
      "reading": "せのお",
      "x": 9628,
      "y": -983
    },
    "備中箕島": {
      "id": "備中箕島",
      "name": "備中箕島",
      "reading": "びっちゅうみしま",
      "say": "ビッチュウ ミシマ",
      "x": 9533,
      "y": -968
    },
    "早島": {
      "id": "早島",
      "name": "早島",
      "reading": "はやしま",
      "x": 9452,
      "y": -948
    },
    "久々原": {
      "id": "久々原",
      "name": "久々原",
      "reading": "くぐはら",
      "x": 9427,
      "y": -894
    },
    "茶屋町": {
      "id": "茶屋町",
      "name": "茶屋町",
      "reading": "ちゃやまち",
      "x": 9417,
      "y": -809
    },
    "植松": {
      "id": "植松",
      "name": "植松",
      "reading": "うえまつ",
      "x": 9427,
      "y": -664
    },
    "木見": {
      "id": "木見",
      "name": "木見",
      "reading": "きみ",
      "x": 9408,
      "y": -536
    },
    "上の町": {
      "id": "上の町",
      "name": "上の町",
      "reading": "かみのちょう",
      "x": 9368,
      "y": -332
    },
    "児島": {
      "id": "児島",
      "name": "児島",
      "reading": "こじま",
      "x": 9334,
      "y": -176
    },
    "博多": {
      "id": "博多",
      "name": "博多",
      "reading": "はかた",
      "say": "博多",
      "x": -6220,
      "y": 4668
    },
    "小倉": {
      "id": "小倉",
      "name": "小倉",
      "reading": "こくら",
      "x": -4096,
      "y": 3019
    },
    "新下関": {
      "id": "新下関",
      "name": "新下関",
      "reading": "しんしものせき",
      "x": -3794,
      "y": 2351
    },
    "厚狭": {
      "id": "厚狭",
      "name": "厚狭",
      "reading": "あさ",
      "x": -2824,
      "y": 2098
    },
    "新岩国": {
      "id": "新岩国",
      "name": "新岩国",
      "reading": "しんいわくに",
      "x": 1736,
      "y": 1454,
      "label": {
        "dx": 12,
        "dy": -18,
        "anchor": "start"
      }
    },
    "東広島": {
      "id": "東広島",
      "name": "東広島",
      "reading": "ひがしひろしま",
      "x": 4520,
      "y": 233
    },
    "新尾道": {
      "id": "新尾道",
      "name": "新尾道",
      "reading": "しんおのみち",
      "say": "しん、おのみち",
      "x": 6498,
      "y": 6
    },
    "相生": {
      "id": "相生",
      "name": "相生",
      "reading": "あいおい",
      "x": 12396,
      "y": -2148
    },
    "姫路": {
      "id": "姫路",
      "name": "姫路",
      "reading": "ひめじ",
      "x": 13392,
      "y": -2192
    },
    "西明石": {
      "id": "西明石",
      "name": "西明石",
      "reading": "にしあかし",
      "x": 14629,
      "y": -1308
    },
    "新神戸": {
      "id": "新神戸",
      "name": "新神戸",
      "reading": "しんこうべ",
      "x": 15715,
      "y": -1532
    },
    "新大阪": {
      "id": "新大阪",
      "name": "新大阪",
      "reading": "しんおおさか",
      "x": 17109,
      "y": -1678
    },
    "京都": {
      "id": "京都",
      "name": "京都",
      "reading": "きょうと",
      "x": 18293,
      "y": -3073
    },
    "米原": {
      "id": "米原",
      "name": "米原",
      "reading": "まいばら",
      "x": 20732,
      "y": -4903
    },
    "岐阜羽島": {
      "id": "岐阜羽島",
      "name": "岐阜羽島",
      "reading": "ぎふはしま",
      "x": 22552,
      "y": -4907
    },
    "名古屋": {
      "id": "名古屋",
      "name": "名古屋",
      "reading": "なごや",
      "x": 23448,
      "y": -4103
    },
    "三河安城": {
      "id": "三河安城",
      "name": "三河安城",
      "reading": "みかわあんじょう",
      "x": 24272,
      "y": -2984
    },
    "豊橋": {
      "id": "豊橋",
      "name": "豊橋",
      "reading": "とよはし",
      "x": 25745,
      "y": -1840
    },
    "浜松": {
      "id": "浜松",
      "name": "浜松",
      "reading": "はままつ",
      "x": 27372,
      "y": -1512
    },
    "掛川": {
      "id": "掛川",
      "name": "掛川",
      "reading": "かけがわ",
      "x": 28661,
      "y": -1876
    },
    "静岡": {
      "id": "静岡",
      "name": "静岡",
      "reading": "しずおか",
      "x": 30377,
      "y": -2999
    },
    "新富士": {
      "id": "新富士",
      "name": "新富士",
      "reading": "しんふじ",
      "x": 31632,
      "y": -3944
    },
    "三島": {
      "id": "三島",
      "name": "三島",
      "reading": "みしま",
      "x": 32765,
      "y": -3859
    },
    "熱海": {
      "id": "熱海",
      "name": "熱海",
      "reading": "あたみ",
      "x": 33539,
      "y": -3735
    },
    "小田原": {
      "id": "小田原",
      "name": "小田原",
      "reading": "おだわら",
      "x": 33891,
      "y": -4577
    },
    "新横浜": {
      "id": "新横浜",
      "name": "新横浜",
      "reading": "しんよこはま",
      "x": 36015,
      "y": -5968
    },
    "品川": {
      "id": "品川",
      "name": "品川",
      "reading": "しながわ",
      "x": 36579,
      "y": -6648
    },
    "東京": {
      "id": "東京",
      "name": "東京",
      "reading": "とうきょう",
      "x": 36707,
      "y": -6934
    },
    "吉塚": {
      "id": "吉塚",
      "name": "吉塚",
      "reading": "よしづか",
      "x": -6207,
      "y": 4571
    },
    "箱崎": {
      "id": "箱崎",
      "name": "箱崎",
      "reading": "はこざき",
      "x": -6194,
      "y": 4511
    },
    "千早": {
      "id": "千早",
      "name": "千早",
      "reading": "ちはや",
      "x": -6129,
      "y": 4337
    },
    "香椎": {
      "id": "香椎",
      "name": "香椎",
      "reading": "かしい",
      "x": -6113,
      "y": 4280
    },
    "和白": {
      "id": "和白",
      "name": "和白",
      "reading": "わじろ",
      "x": -6180,
      "y": 4118
    },
    "奈多": {
      "id": "奈多",
      "name": "奈多",
      "reading": "なた",
      "x": -6260,
      "y": 4131
    },
    "雁ノ巣": {
      "id": "雁ノ巣",
      "name": "雁ノ巣",
      "reading": "がんのす",
      "x": -6303,
      "y": 4146,
      "label": {
        "dy": 44
      }
    },
    "海ノ中道": {
      "id": "海ノ中道",
      "name": "海ノ中道",
      "reading": "うみのなかみち",
      "x": -6493,
      "y": 4255
    },
    "西戸崎": {
      "id": "西戸崎",
      "name": "西戸崎",
      "reading": "さいとざき",
      "x": -6509,
      "y": 4330
    },
    "九産大前": {
      "id": "九産大前",
      "name": "九産大前",
      "reading": "きゅうさんだいまえ",
      "x": -6127,
      "y": 4202
    },
    "福工大前": {
      "id": "福工大前",
      "name": "福工大前",
      "reading": "ふっこうだいまえ",
      "x": -6129,
      "y": 4063
    },
    "新宮中央": {
      "id": "新宮中央",
      "name": "新宮中央",
      "reading": "しんぐうちゅうおう",
      "x": -6089,
      "y": 3989
    },
    "ししぶ": {
      "id": "ししぶ",
      "name": "ししぶ",
      "reading": "ししぶ",
      "x": -6053,
      "y": 3940
    },
    "古賀": {
      "id": "古賀",
      "name": "古賀",
      "reading": "こが",
      "x": -6009,
      "y": 3875
    },
    "千鳥": {
      "id": "千鳥",
      "name": "千鳥",
      "reading": "ちどり",
      "x": -5965,
      "y": 3784
    },
    "福間": {
      "id": "福間",
      "name": "福間",
      "reading": "ふくま",
      "x": -5916,
      "y": 3702
    },
    "東福間": {
      "id": "東福間",
      "name": "東福間",
      "reading": "ひがしふくま",
      "x": -5808,
      "y": 3646
    },
    "東郷": {
      "id": "東郷",
      "name": "東郷",
      "reading": "とうごう",
      "x": -5724,
      "y": 3532
    },
    "赤間": {
      "id": "赤間",
      "name": "赤間",
      "reading": "あかま",
      "x": -5537,
      "y": 3456
    },
    "教育大前": {
      "id": "教育大前",
      "name": "教育大前",
      "reading": "きょういくだいまえ",
      "x": -5442,
      "y": 3456
    },
    "海老津": {
      "id": "海老津",
      "name": "海老津",
      "reading": "えびつ",
      "x": -5290,
      "y": 3279
    },
    "遠賀川": {
      "id": "遠賀川",
      "name": "遠賀川",
      "reading": "おんががわ",
      "x": -5059,
      "y": 3242
    },
    "水巻": {
      "id": "水巻",
      "name": "水巻",
      "reading": "みずまき",
      "x": -4955,
      "y": 3210
    },
    "折尾": {
      "id": "折尾",
      "name": "折尾",
      "reading": "おりお",
      "x": -4879,
      "y": 3147
    },
    "陣原": {
      "id": "陣原",
      "name": "陣原",
      "reading": "じんのはる",
      "x": -4739,
      "y": 3124
    },
    "黒崎": {
      "id": "黒崎",
      "name": "黒崎",
      "reading": "くろさき",
      "x": -4633,
      "y": 3130
    },
    "八幡": {
      "id": "八幡",
      "name": "八幡",
      "reading": "やはた",
      "x": -4501,
      "y": 3117
    },
    "スペースワールド": {
      "id": "スペースワールド",
      "name": "スペースワールド",
      "reading": "すぺーすわーるど",
      "x": -4451,
      "y": 3106
    },
    "枝光": {
      "id": "枝光",
      "name": "枝光",
      "reading": "えだみつ",
      "x": -4420,
      "y": 3062
    },
    "戸畑": {
      "id": "戸畑",
      "name": "戸畑",
      "reading": "とばた",
      "x": -4383,
      "y": 2961
    },
    "九州工大前": {
      "id": "九州工大前",
      "name": "九州工大前",
      "reading": "きゅうしゅうこうだいまえ",
      "x": -4295,
      "y": 2944
    },
    "西小倉": {
      "id": "西小倉",
      "name": "西小倉",
      "reading": "にしこくら",
      "x": -4139,
      "y": 3009
    },
    "新鳥栖": {
      "id": "新鳥栖",
      "name": "新鳥栖",
      "reading": "しんとす",
      "x": -5898,
      "y": 5884
    },
    "久留米": {
      "id": "久留米",
      "name": "久留米",
      "reading": "くるめ",
      "x": -5852,
      "y": 6160
    },
    "筑後船小屋": {
      "id": "筑後船小屋",
      "name": "筑後船小屋",
      "reading": "ちくごふなごや",
      "x": -5892,
      "y": 6952
    },
    "新大牟田": {
      "id": "新大牟田",
      "name": "新大牟田",
      "reading": "しんおおむた",
      "x": -5909,
      "y": 7544
    },
    "新玉名": {
      "id": "新玉名",
      "name": "新玉名",
      "reading": "しんたまな",
      "x": -5520,
      "y": 8257
    },
    "熊本": {
      "id": "熊本",
      "name": "熊本",
      "reading": "くまもと",
      "x": -4990,
      "y": 9101
    },
    "新八代": {
      "id": "新八代",
      "name": "新八代",
      "reading": "しんやつしろ",
      "x": -5237,
      "y": 10616
    },
    "新水俣": {
      "id": "新水俣",
      "name": "新水俣",
      "reading": "しんみなまた",
      "x": -6184,
      "y": 12318
    },
    "出水": {
      "id": "出水",
      "name": "出水",
      "reading": "いずみ",
      "x": -6507,
      "y": 12991
    },
    "川内": {
      "id": "川内",
      "name": "川内",
      "reading": "せんだい",
      "x": -6718,
      "y": 14521
    },
    "鹿児島中央": {
      "id": "鹿児島中央",
      "name": "鹿児島中央",
      "reading": "かごしまちゅうおう",
      "say": "鹿児島中央",
      "x": -5668,
      "y": 15796,
      "label": {
        "dx": 14,
        "dy": 30,
        "anchor": "start"
      }
    },
    "上野": {
      "id": "上野",
      "name": "上野",
      "reading": "うえの",
      "x": 36750,
      "y": -7113
    },
    "大宮": {
      "id": "大宮",
      "name": "大宮",
      "reading": "おおみや",
      "x": 36042,
      "y": -8183
    },
    "小山": {
      "id": "小山",
      "name": "小山",
      "reading": "おやま",
      "x": 36883,
      "y": -10443
    },
    "宇都宮": {
      "id": "宇都宮",
      "name": "宇都宮",
      "reading": "うつのみや",
      "x": 37305,
      "y": -11803
    },
    "那須塩原": {
      "id": "那須塩原",
      "name": "那須塩原",
      "reading": "なすしおばら",
      "x": 37867,
      "y": -13870
    },
    "新白河": {
      "id": "新白河",
      "name": "新白河",
      "reading": "しんしらかわ",
      "x": 38641,
      "y": -14936
    },
    "郡山": {
      "id": "郡山",
      "name": "郡山",
      "reading": "こおりやま",
      "x": 39557,
      "y": -16462
    },
    "福島": {
      "id": "福島",
      "name": "福島",
      "reading": "ふくしま",
      "x": 39879,
      "y": -18432
    },
    "白石蔵王": {
      "id": "白石蔵王",
      "name": "白石蔵王",
      "reading": "しろいしざおう",
      "x": 40680,
      "y": -19770
    },
    "仙台": {
      "id": "仙台",
      "name": "仙台",
      "reading": "せんだい",
      "x": 41824,
      "y": -21246
    },
    "古川": {
      "id": "古川",
      "name": "古川",
      "reading": "ふるかわ",
      "x": 42217,
      "y": -22964
    },
    "くりこま高原": {
      "id": "くりこま高原",
      "name": "くりこま高原",
      "reading": "くりこまこうげん",
      "x": 42692,
      "y": -23949
    },
    "一ノ関": {
      "id": "一ノ関",
      "name": "一ノ関",
      "reading": "いちのせき",
      "x": 43004,
      "y": -24938
    },
    "水沢江刺": {
      "id": "水沢江刺",
      "name": "水沢江刺",
      "reading": "みずさわえさし",
      "x": 43232,
      "y": -26151
    },
    "北上": {
      "id": "北上",
      "name": "北上",
      "reading": "きたかみ",
      "x": 42928,
      "y": -26911
    },
    "新花巻": {
      "id": "新花巻",
      "name": "新花巻",
      "reading": "しんはなまき",
      "x": 43163,
      "y": -27601
    },
    "盛岡": {
      "id": "盛岡",
      "name": "盛岡",
      "reading": "もりおか",
      "x": 42992,
      "y": -29238
    },
    "いわて沼宮内": {
      "id": "いわて沼宮内",
      "name": "いわて沼宮内",
      "reading": "いわてぬまくない",
      "x": 43364,
      "y": -30675
    },
    "二戸": {
      "id": "二戸",
      "name": "二戸",
      "reading": "にのへ",
      "x": 43677,
      "y": -32334
    },
    "八戸": {
      "id": "八戸",
      "name": "八戸",
      "reading": "はちのへ",
      "x": 44344,
      "y": -33719
    },
    "七戸十和田": {
      "id": "七戸十和田",
      "name": "七戸十和田",
      "reading": "しちのへとわだ",
      "x": 43072,
      "y": -34887
    },
    "新青森": {
      "id": "新青森",
      "name": "新青森",
      "reading": "しんあおもり",
      "x": 40958,
      "y": -35485
    },
    "奥津軽いまべつ": {
      "id": "奥津軽いまべつ",
      "name": "奥津軽いまべつ",
      "reading": "おくつがるいまべつ",
      "x": 40141,
      "y": -37245
    },
    "木古内": {
      "id": "木古内",
      "name": "木古内",
      "reading": "きこない",
      "x": 39767,
      "y": -40205
    },
    "新函館北斗": {
      "id": "新函館北斗",
      "name": "新函館北斗",
      "reading": "しんはこだてほくと",
      "x": 40752,
      "y": -41459
    },
    "坂出": {
      "id": "坂出",
      "name": "坂出",
      "reading": "さかいで",
      "x": 9559,
      "y": 654
    },
    "八十場": {
      "id": "八十場",
      "name": "八十場",
      "reading": "やそば",
      "x": 9688,
      "y": 655
    },
    "鴨川": {
      "id": "鴨川",
      "name": "鴨川",
      "reading": "かもがわ",
      "x": 9782,
      "y": 689
    },
    "讃岐府中": {
      "id": "讃岐府中",
      "name": "讃岐府中",
      "reading": "さぬきふちゅう",
      "x": 9868,
      "y": 775
    },
    "国分": {
      "id": "国分",
      "name": "国分",
      "reading": "こくぶ",
      "x": 9950,
      "y": 724
    },
    "端岡": {
      "id": "端岡",
      "name": "端岡",
      "reading": "はしおか",
      "x": 10071,
      "y": 700
    },
    "鬼無": {
      "id": "鬼無",
      "name": "鬼無",
      "reading": "きなし",
      "x": 10188,
      "y": 587
    },
    "香西": {
      "id": "香西",
      "name": "香西",
      "reading": "こうざい",
      "x": 10263,
      "y": 498
    },
    "高松": {
      "id": "高松",
      "name": "高松",
      "reading": "たかまつ",
      "x": 10425,
      "y": 447
    },
    "熊谷": {
      "id": "熊谷",
      "name": "熊谷",
      "reading": "くまがや",
      "x": 34970,
      "y": -9477
    },
    "本庄早稲田": {
      "id": "本庄早稲田",
      "name": "本庄早稲田",
      "reading": "ほんじょうわせだ",
      "say": "本庄、早稲田",
      "x": 34006,
      "y": -9916
    },
    "高崎": {
      "id": "高崎",
      "name": "高崎",
      "reading": "たかさき",
      "x": 33240,
      "y": -10493
    },
    "安中榛名": {
      "id": "安中榛名",
      "name": "安中榛名",
      "reading": "あんなかはるな",
      "x": 32489,
      "y": -10714
    },
    "軽井沢": {
      "id": "軽井沢",
      "name": "軽井沢",
      "reading": "かるいざわ",
      "x": 31503,
      "y": -10604
    },
    "佐久平": {
      "id": "佐久平",
      "name": "佐久平",
      "reading": "さくだいら",
      "x": 30722,
      "y": -10246
    },
    "上田": {
      "id": "上田",
      "name": "上田",
      "reading": "うえだ",
      "x": 29737,
      "y": -10901
    },
    "長野": {
      "id": "長野",
      "name": "長野",
      "reading": "ながの",
      "x": 29455,
      "y": -12269
    },
    "飯山": {
      "id": "飯山",
      "name": "飯山",
      "reading": "いいやま",
      "x": 30236,
      "y": -13392
    },
    "上越妙高": {
      "id": "上越妙高",
      "name": "上越妙高",
      "reading": "じょうえつみょうこう",
      "say": "上越、妙高",
      "x": 29729,
      "y": -14702
    },
    "糸魚川": {
      "id": "糸魚川",
      "name": "糸魚川",
      "reading": "いといがわ",
      "x": 27950,
      "y": -14490
    },
    "黒部宇奈月温泉": {
      "id": "黒部宇奈月温泉",
      "name": "黒部宇奈月温泉",
      "reading": "くろべうなづきおんせん",
      "x": 26205,
      "y": -13552
    },
    "富山": {
      "id": "富山",
      "name": "富山",
      "reading": "とやま",
      "x": 24975,
      "y": -12594
    },
    "新高岡": {
      "id": "新高岡",
      "name": "新高岡",
      "reading": "しんたかおか",
      "x": 24049,
      "y": -12736
    },
    "金沢": {
      "id": "金沢",
      "name": "金沢",
      "reading": "かなざわ",
      "x": 22379,
      "y": -11909
    },
    "小松": {
      "id": "小松",
      "name": "小松",
      "reading": "こまつ",
      "x": 21483,
      "y": -10935
    },
    "加賀温泉": {
      "id": "加賀温泉",
      "name": "加賀温泉",
      "reading": "かがおんせん",
      "x": 21013,
      "y": -10480
    },
    "芦原温泉": {
      "id": "芦原温泉",
      "name": "芦原温泉",
      "reading": "あわらおんせん",
      "x": 20483,
      "y": -9898
    },
    "福井": {
      "id": "福井",
      "name": "福井",
      "reading": "ふくい",
      "x": 20428,
      "y": -9045
    },
    "越前たけふ": {
      "id": "越前たけふ",
      "name": "越前たけふ",
      "reading": "えちぜんたけふ",
      "x": 20316,
      "y": -8124
    },
    "敦賀": {
      "id": "敦賀",
      "name": "敦賀",
      "reading": "つるが",
      "x": 19757,
      "y": -6733
    },
    "新疋田": {
      "id": "新疋田",
      "name": "新疋田",
      "reading": "しんひきだ",
      "x": 19865,
      "y": -6452
    },
    "近江塩津": {
      "id": "近江塩津",
      "name": "近江塩津",
      "reading": "おうみしおつ",
      "x": 20098,
      "y": -6150
    },
    "永原": {
      "id": "永原",
      "name": "永原",
      "reading": "ながはら",
      "x": 19965,
      "y": -5924
    },
    "マキノ": {
      "id": "マキノ",
      "name": "マキノ",
      "reading": "まきの",
      "x": 19675,
      "y": -5713
    },
    "近江中庄": {
      "id": "近江中庄",
      "name": "近江中庄",
      "reading": "おうみなかしょう",
      "x": 19579,
      "y": -5600
    },
    "近江今津": {
      "id": "近江今津",
      "name": "近江今津",
      "reading": "おうみいまづ",
      "x": 19551,
      "y": -5365
    },
    "新旭": {
      "id": "新旭",
      "name": "新旭",
      "reading": "しんあさひ",
      "x": 19566,
      "y": -5128
    },
    "安曇川": {
      "id": "安曇川",
      "name": "安曇川",
      "reading": "あどがわ",
      "x": 19494,
      "y": -4975
    },
    "近江高島": {
      "id": "近江高島",
      "name": "近江高島",
      "reading": "おうみたかしま",
      "x": 19449,
      "y": -4780
    },
    "北小松": {
      "id": "北小松",
      "name": "北小松",
      "reading": "きたこまつ",
      "x": 19265,
      "y": -4561
    },
    "近江舞子": {
      "id": "近江舞子",
      "name": "近江舞子",
      "reading": "おうみまいこ",
      "x": 19216,
      "y": -4467
    },
    "比良": {
      "id": "比良",
      "name": "比良",
      "reading": "ひら",
      "x": 19145,
      "y": -4376
    },
    "志賀": {
      "id": "志賀",
      "name": "志賀",
      "reading": "しが",
      "x": 19057,
      "y": -4278
    },
    "蓬莱": {
      "id": "蓬莱",
      "name": "蓬莱",
      "reading": "ほうらい",
      "x": 19013,
      "y": -4168
    },
    "和邇": {
      "id": "和邇",
      "name": "和邇",
      "reading": "わに",
      "x": 19046,
      "y": -4052
    },
    "小野": {
      "id": "小野",
      "name": "小野",
      "reading": "おの",
      "x": 19047,
      "y": -3926
    },
    "堅田": {
      "id": "堅田",
      "name": "堅田",
      "reading": "かたた",
      "x": 19012,
      "y": -3827
    },
    "おごと温泉": {
      "id": "おごと温泉",
      "name": "おごと温泉",
      "reading": "おごとおんせん",
      "x": 18918,
      "y": -3693
    },
    "比叡山坂本": {
      "id": "比叡山坂本",
      "name": "比叡山坂本",
      "reading": "ひえいざんさかもと",
      "x": 18844,
      "y": -3549
    },
    "唐崎": {
      "id": "唐崎",
      "name": "唐崎",
      "reading": "からさき",
      "x": 18791,
      "y": -3432
    },
    "大津京": {
      "id": "大津京",
      "name": "大津京",
      "reading": "おおつきょう",
      "x": 18745,
      "y": -3290
    },
    "山科": {
      "id": "山科",
      "name": "山科",
      "reading": "やましな",
      "x": 18560,
      "y": -3115
    },
    "西大路": {
      "id": "西大路",
      "name": "西大路",
      "reading": "にしおおじ",
      "x": 18169,
      "y": -3050
    },
    "桂川": {
      "id": "桂川",
      "name": "桂川",
      "reading": "かつらがわ",
      "x": 18072,
      "y": -2960
    },
    "向日町": {
      "id": "向日町",
      "name": "向日町",
      "reading": "むこうまち",
      "x": 18070,
      "y": -2907
    },
    "長岡京": {
      "id": "長岡京",
      "name": "長岡京",
      "reading": "ながおかきょう",
      "x": 18029,
      "y": -2731
    },
    "山崎": {
      "id": "山崎",
      "name": "山崎",
      "reading": "やまざき",
      "x": 17928,
      "y": -2558
    },
    "島本": {
      "id": "島本",
      "name": "島本",
      "reading": "しまもと",
      "x": 17852,
      "y": -2492
    },
    "高槻": {
      "id": "高槻",
      "name": "高槻",
      "reading": "たかつき",
      "x": 17644,
      "y": -2330
    },
    "摂津富田": {
      "id": "摂津富田",
      "name": "摂津富田",
      "reading": "せっつとんだ",
      "x": 17535,
      "y": -2255
    },
    "JR総持寺": {
      "id": "JR総持寺",
      "name": "JR総持寺",
      "reading": "じぇいあーるそうじじ",
      "x": 17463,
      "y": -2204
    },
    "茨木": {
      "id": "茨木",
      "name": "茨木",
      "reading": "いばらき",
      "x": 17391,
      "y": -2130
    },
    "千里丘": {
      "id": "千里丘",
      "name": "千里丘",
      "reading": "せんりおか",
      "x": 17342,
      "y": -1999
    },
    "岸辺": {
      "id": "岸辺",
      "name": "岸辺",
      "reading": "きしべ",
      "x": 17296,
      "y": -1918
    },
    "吹田": {
      "id": "吹田",
      "name": "吹田",
      "reading": "すいた",
      "x": 17215,
      "y": -1842
    },
    "東淀川": {
      "id": "東淀川",
      "name": "東淀川",
      "reading": "ひがしよどがわ",
      "x": 17124,
      "y": -1709
    },
    "大阪": {
      "id": "大阪",
      "name": "大阪",
      "reading": "おおさか",
      "x": 17084,
      "y": -1505
    },
    "福島（大阪）": {
      "id": "福島（大阪）",
      "name": "福島",
      "reading": "ふくしま",
      "x": 17044,
      "y": -1476
    },
    "野田": {
      "id": "野田",
      "name": "野田",
      "reading": "のだ",
      "x": 16991,
      "y": -1430
    },
    "西九条": {
      "id": "西九条",
      "name": "西九条",
      "reading": "にしくじょう",
      "x": 16954,
      "y": -1396
    },
    "弁天町": {
      "id": "弁天町",
      "name": "弁天町",
      "reading": "べんてんちょう",
      "x": 16931,
      "y": -1325
    },
    "大正": {
      "id": "大正",
      "name": "大正",
      "reading": "たいしょう",
      "x": 17014,
      "y": -1300
    },
    "芦原橋": {
      "id": "芦原橋",
      "name": "芦原橋",
      "reading": "あしはらばし",
      "x": 17055,
      "y": -1264
    },
    "今宮": {
      "id": "今宮",
      "name": "今宮",
      "reading": "いまみや",
      "x": 17073,
      "y": -1235
    },
    "新今宮": {
      "id": "新今宮",
      "name": "新今宮",
      "reading": "しんいまみや",
      "x": 17114,
      "y": -1214
    },
    "天王寺": {
      "id": "天王寺",
      "name": "天王寺",
      "reading": "てんのうじ",
      "x": 17178,
      "y": -1196
    },
    "寺田町": {
      "id": "寺田町",
      "name": "寺田町",
      "reading": "てらだちょう",
      "x": 17214,
      "y": -1203
    },
    "桃谷": {
      "id": "桃谷",
      "name": "桃谷",
      "reading": "ももだに",
      "x": 17235,
      "y": -1261
    },
    "鶴橋": {
      "id": "鶴橋",
      "name": "鶴橋",
      "reading": "つるはし",
      "x": 17245,
      "y": -1300
    },
    "玉造": {
      "id": "玉造",
      "name": "玉造",
      "reading": "たまつくり",
      "x": 17257,
      "y": -1345
    },
    "森ノ宮": {
      "id": "森ノ宮",
      "name": "森ノ宮",
      "reading": "もりのみや",
      "x": 17262,
      "y": -1383
    },
    "大阪城公園": {
      "id": "大阪城公園",
      "name": "大阪城公園",
      "reading": "おおさかじょうこうえん",
      "x": 17264,
      "y": -1424
    },
    "京橋": {
      "id": "京橋",
      "name": "京橋",
      "reading": "きょうばし",
      "x": 17262,
      "y": -1472
    },
    "桜ノ宮": {
      "id": "桜ノ宮",
      "name": "桜ノ宮",
      "reading": "さくらのみや",
      "x": 17203,
      "y": -1519
    },
    "天満": {
      "id": "天満",
      "name": "天満",
      "reading": "てんま",
      "x": 17163,
      "y": -1519
    },
    "安治川口": {
      "id": "安治川口",
      "name": "安治川口",
      "reading": "あじかわぐち",
      "x": 16848,
      "y": -1344
    },
    "ユニバーサルシティ": {
      "id": "ユニバーサルシティ",
      "name": "ユニバーサルシティ",
      "reading": "ゆにばーさるしてぃ",
      "x": 16824,
      "y": -1313
    },
    "桜島": {
      "id": "桜島",
      "name": "桜島",
      "reading": "さくらじま",
      "x": 16796,
      "y": -1281
    }
  },
  "edges": [
    {
      "id": "sanyo-w8",
      "a": "新山口",
      "b": "四辻",
      "line": "sanyo",
      "via": [
        [
          -1719,
          1862
        ],
        [
          -1684,
          1866
        ]
      ]
    },
    {
      "id": "sanyo-w7",
      "a": "四辻",
      "b": "大道",
      "line": "sanyo",
      "via": [
        [
          -1439,
          2004
        ],
        [
          -1404,
          2045
        ]
      ]
    },
    {
      "id": "sanyo-w6",
      "a": "大道",
      "b": "防府",
      "line": "sanyo",
      "via": [
        [
          -1281,
          2120
        ],
        [
          -1204,
          2135
        ],
        [
          -1175,
          2147
        ],
        [
          -975,
          2097
        ]
      ]
    },
    {
      "id": "sanyo-w5",
      "a": "防府",
      "b": "富海",
      "line": "sanyo",
      "via": [
        [
          -846,
          2109
        ],
        [
          -792,
          2143
        ],
        [
          -718,
          2176
        ],
        [
          -701,
          2174
        ]
      ]
    },
    {
      "id": "sanyo-w4",
      "a": "富海",
      "b": "戸田",
      "line": "sanyo",
      "via": [
        [
          -604,
          2124
        ],
        [
          -560,
          2167
        ],
        [
          -529,
          2166
        ],
        [
          -497,
          2144
        ],
        [
          -469,
          2135
        ],
        [
          -452,
          2095
        ],
        [
          -442,
          2087
        ],
        [
          -410,
          2096
        ],
        [
          -391,
          2089
        ],
        [
          -363,
          2028
        ],
        [
          -335,
          2007
        ]
      ]
    },
    {
      "id": "sanyo-w3",
      "a": "戸田",
      "b": "福川",
      "line": "sanyo",
      "via": [
        [
          -314,
          1968
        ],
        [
          -282,
          1945
        ],
        [
          -191,
          1991
        ]
      ]
    },
    {
      "id": "sanyo-w2",
      "a": "福川",
      "b": "新南陽",
      "line": "sanyo"
    },
    {
      "id": "sanyo-w1",
      "a": "新南陽",
      "b": "徳山",
      "line": "sanyo",
      "via": [
        [
          64,
          2020
        ],
        [
          100,
          2046
        ]
      ]
    },
    {
      "id": "sanyo-1",
      "a": "徳山",
      "b": "櫛ケ浜",
      "line": "sanyo",
      "via": [
        [
          146,
          2134
        ],
        [
          226,
          2186
        ]
      ]
    },
    {
      "id": "sanyo-2",
      "a": "櫛ケ浜",
      "b": "下松",
      "line": "sanyo",
      "via": [
        [
          260,
          2247
        ],
        [
          291,
          2284
        ],
        [
          318,
          2296
        ],
        [
          386,
          2308
        ],
        [
          414,
          2325
        ]
      ]
    },
    {
      "id": "sanyo-3",
      "a": "下松",
      "b": "光",
      "line": "sanyo",
      "via": [
        [
          466,
          2405
        ],
        [
          508,
          2443
        ],
        [
          522,
          2472
        ],
        [
          578,
          2529
        ],
        [
          606,
          2538
        ]
      ]
    },
    {
      "id": "sanyo-4",
      "a": "光",
      "b": "島田",
      "line": "sanyo",
      "via": [
        [
          659,
          2534
        ],
        [
          707,
          2508
        ],
        [
          833,
          2467
        ]
      ]
    },
    {
      "id": "sanyo-5",
      "a": "島田",
      "b": "岩田",
      "line": "sanyo",
      "via": [
        [
          883,
          2392
        ],
        [
          930,
          2386
        ],
        [
          952,
          2400
        ],
        [
          974,
          2449
        ]
      ]
    },
    {
      "id": "sanyo-6",
      "a": "岩田",
      "b": "田布施",
      "line": "sanyo",
      "via": [
        [
          1029,
          2522
        ],
        [
          1072,
          2537
        ],
        [
          1088,
          2558
        ],
        [
          1113,
          2569
        ],
        [
          1155,
          2614
        ]
      ]
    },
    {
      "id": "sanyo-7",
      "a": "田布施",
      "b": "柳井",
      "line": "sanyo",
      "via": [
        [
          1269,
          2611
        ],
        [
          1371,
          2555
        ],
        [
          1467,
          2554
        ]
      ]
    },
    {
      "id": "sanyo-8",
      "a": "柳井",
      "b": "柳井港",
      "line": "sanyo",
      "via": [
        [
          1534,
          2589
        ],
        [
          1563,
          2589
        ]
      ]
    },
    {
      "id": "sanyo-9",
      "a": "柳井港",
      "b": "大畠",
      "line": "sanyo",
      "via": [
        [
          1735,
          2633
        ],
        [
          1781,
          2622
        ],
        [
          1830,
          2596
        ]
      ]
    },
    {
      "id": "sanyo-10",
      "a": "大畠",
      "b": "神代",
      "line": "sanyo",
      "via": [
        [
          1884,
          2600
        ],
        [
          1900,
          2586
        ],
        [
          1944,
          2501
        ],
        [
          1948,
          2465
        ],
        [
          1958,
          2444
        ]
      ]
    },
    {
      "id": "sanyo-11",
      "a": "神代",
      "b": "由宇",
      "line": "sanyo",
      "via": [
        [
          2012,
          2370
        ],
        [
          2032,
          2255
        ]
      ]
    },
    {
      "id": "sanyo-12",
      "a": "由宇",
      "b": "通津",
      "line": "sanyo",
      "via": [
        [
          2005,
          2108
        ],
        [
          1979,
          2058
        ]
      ]
    },
    {
      "id": "sanyo-13",
      "a": "通津",
      "b": "藤生",
      "line": "sanyo",
      "via": [
        [
          1998,
          1923
        ],
        [
          1961,
          1839
        ]
      ]
    },
    {
      "id": "sanyo-14",
      "a": "藤生",
      "b": "南岩国",
      "line": "sanyo",
      "via": [
        [
          1942,
          1742
        ],
        [
          1957,
          1709
        ],
        [
          1965,
          1664
        ]
      ]
    },
    {
      "id": "sanyo-15",
      "a": "南岩国",
      "b": "岩国",
      "line": "sanyo",
      "via": [
        [
          2021,
          1585
        ],
        [
          2051,
          1528
        ],
        [
          2060,
          1506
        ],
        [
          2058,
          1472
        ]
      ]
    },
    {
      "id": "sanyo-16",
      "a": "岩国",
      "b": "和木",
      "line": "sanyo",
      "via": [
        [
          2089,
          1376
        ],
        [
          2082,
          1342
        ],
        [
          2092,
          1291
        ]
      ]
    },
    {
      "id": "sanyo-17",
      "a": "和木",
      "b": "大竹",
      "line": "sanyo"
    },
    {
      "id": "sanyo-18",
      "a": "大竹",
      "b": "玖波",
      "line": "sanyo",
      "via": [
        [
          2035,
          1076
        ],
        [
          2044,
          1035
        ],
        [
          2059,
          1019
        ]
      ]
    },
    {
      "id": "sanyo-19",
      "a": "玖波",
      "b": "大野浦",
      "line": "sanyo",
      "via": [
        [
          2099,
          950
        ],
        [
          2172,
          920
        ],
        [
          2226,
          867
        ]
      ]
    },
    {
      "id": "sanyo-20",
      "a": "大野浦",
      "b": "前空",
      "line": "sanyo",
      "via": [
        [
          2268,
          796
        ],
        [
          2325,
          783
        ]
      ]
    },
    {
      "id": "sanyo-21",
      "a": "前空",
      "b": "宮島口",
      "line": "sanyo",
      "via": [
        [
          2400,
          693
        ]
      ]
    },
    {
      "id": "sanyo-22",
      "a": "宮島口",
      "b": "阿品",
      "line": "sanyo",
      "via": [
        [
          2433,
          643
        ],
        [
          2463,
          621
        ]
      ]
    },
    {
      "id": "sanyo-23",
      "a": "阿品",
      "b": "宮内串戸",
      "line": "sanyo",
      "via": [
        [
          2496,
          549
        ],
        [
          2499,
          505
        ],
        [
          2515,
          478
        ]
      ]
    },
    {
      "id": "sanyo-24",
      "a": "宮内串戸",
      "b": "廿日市",
      "line": "sanyo",
      "via": [
        [
          2527,
          436
        ],
        [
          2552,
          424
        ]
      ]
    },
    {
      "id": "sanyo-25",
      "a": "廿日市",
      "b": "五日市",
      "line": "sanyo",
      "via": [
        [
          2606,
          370
        ]
      ]
    },
    {
      "id": "sanyo-26",
      "a": "五日市",
      "b": "新井口",
      "line": "sanyo",
      "via": [
        [
          2793,
          336
        ]
      ]
    },
    {
      "id": "sanyo-27",
      "a": "新井口",
      "b": "西広島",
      "line": "sanyo",
      "via": [
        [
          2941,
          234
        ]
      ]
    },
    {
      "id": "sanyo-28",
      "a": "西広島",
      "b": "横川",
      "line": "sanyo",
      "via": [
        [
          3049,
          126
        ]
      ]
    },
    {
      "id": "sanyo-29",
      "a": "横川",
      "b": "新白島",
      "line": "sanyo",
      "via": [
        [
          3128,
          117
        ]
      ]
    },
    {
      "id": "sanyo-30",
      "a": "新白島",
      "b": "広島",
      "line": "sanyo",
      "via": [
        [
          3174,
          138
        ],
        [
          3194,
          172
        ]
      ]
    },
    {
      "id": "sanyo-31",
      "a": "広島",
      "b": "天神川",
      "line": "sanyo",
      "via": [
        [
          3243,
          203
        ],
        [
          3288,
          215
        ]
      ]
    },
    {
      "id": "sanyo-32",
      "a": "天神川",
      "b": "向洋",
      "line": "sanyo",
      "via": [
        [
          3340,
          244
        ],
        [
          3343,
          280
        ]
      ]
    },
    {
      "id": "sanyo-33",
      "a": "向洋",
      "b": "海田市",
      "line": "sanyo",
      "via": [
        [
          3371,
          314
        ],
        [
          3404,
          311
        ]
      ]
    },
    {
      "id": "sanyo-34",
      "a": "海田市",
      "b": "安芸中野",
      "line": "sanyo",
      "via": [
        [
          3457,
          324
        ],
        [
          3478,
          330
        ],
        [
          3504,
          327
        ],
        [
          3548,
          301
        ]
      ]
    },
    {
      "id": "sanyo-35",
      "a": "安芸中野",
      "b": "中野東",
      "line": "sanyo",
      "via": [
        [
          3637,
          203
        ],
        [
          3681,
          179
        ]
      ]
    },
    {
      "id": "sanyo-36",
      "a": "中野東",
      "b": "瀬野",
      "line": "sanyo",
      "via": [
        [
          3720,
          89
        ],
        [
          3736,
          76
        ],
        [
          3745,
          56
        ]
      ]
    },
    {
      "id": "sanyo-37",
      "a": "瀬野",
      "b": "八本松",
      "line": "sanyo",
      "via": [
        [
          3852,
          45
        ],
        [
          3944,
          -27
        ],
        [
          3974,
          -32
        ],
        [
          3996,
          -17
        ],
        [
          4015,
          -17
        ],
        [
          4023,
          -29
        ],
        [
          4019,
          -51
        ],
        [
          4026,
          -65
        ],
        [
          4057,
          -72
        ],
        [
          4070,
          -91
        ],
        [
          4091,
          -97
        ],
        [
          4105,
          -113
        ],
        [
          4133,
          -106
        ],
        [
          4173,
          -78
        ]
      ]
    },
    {
      "id": "sanyo-38",
      "a": "八本松",
      "b": "寺家",
      "line": "sanyo",
      "via": [
        [
          4223,
          -98
        ],
        [
          4317,
          -89
        ],
        [
          4327,
          -83
        ]
      ]
    },
    {
      "id": "sanyo-39",
      "a": "寺家",
      "b": "西条",
      "line": "sanyo",
      "via": [
        [
          4366,
          -25
        ],
        [
          4406,
          0
        ],
        [
          4422,
          4
        ]
      ]
    },
    {
      "id": "sanyo-40",
      "a": "西条",
      "b": "西高屋",
      "line": "sanyo",
      "via": [
        [
          4481,
          -10
        ],
        [
          4540,
          -41
        ],
        [
          4610,
          -68
        ],
        [
          4630,
          -87
        ]
      ]
    },
    {
      "id": "sanyo-41",
      "a": "西高屋",
      "b": "白市",
      "line": "sanyo",
      "via": [
        [
          4704,
          -68
        ],
        [
          4742,
          -89
        ],
        [
          4777,
          -81
        ],
        [
          4822,
          -85
        ]
      ]
    },
    {
      "id": "sanyo-42",
      "a": "白市",
      "b": "入野",
      "line": "sanyo",
      "via": [
        [
          4912,
          -58
        ],
        [
          4930,
          -66
        ],
        [
          4940,
          -87
        ],
        [
          4964,
          -113
        ],
        [
          4960,
          -125
        ],
        [
          4936,
          -134
        ],
        [
          4930,
          -142
        ],
        [
          4931,
          -156
        ]
      ]
    },
    {
      "id": "sanyo-43",
      "a": "入野",
      "b": "河内",
      "line": "sanyo",
      "via": [
        [
          4954,
          -173
        ],
        [
          4964,
          -194
        ],
        [
          5009,
          -238
        ],
        [
          5038,
          -230
        ],
        [
          5095,
          -224
        ]
      ]
    },
    {
      "id": "sanyo-44",
      "a": "河内",
      "b": "本郷",
      "line": "sanyo",
      "via": [
        [
          5172,
          -200
        ],
        [
          5198,
          -178
        ],
        [
          5238,
          -170
        ],
        [
          5385,
          -109
        ],
        [
          5396,
          -90
        ],
        [
          5398,
          -61
        ],
        [
          5435,
          -56
        ],
        [
          5454,
          -27
        ],
        [
          5534,
          41
        ],
        [
          5540,
          104
        ]
      ]
    },
    {
      "id": "sanyo-45",
      "a": "本郷",
      "b": "三原",
      "line": "sanyo",
      "via": [
        [
          5588,
          125
        ],
        [
          5667,
          122
        ],
        [
          5730,
          177
        ],
        [
          5802,
          205
        ],
        [
          5872,
          182
        ]
      ]
    },
    {
      "id": "kabe-1",
      "a": "横川",
      "b": "三滝",
      "line": "kabe",
      "via": [
        [
          3089,
          112
        ],
        [
          3076,
          93
        ]
      ]
    },
    {
      "id": "kabe-2",
      "a": "三滝",
      "b": "安芸長束",
      "line": "kabe"
    },
    {
      "id": "kabe-3",
      "a": "安芸長束",
      "b": "下祇園",
      "line": "kabe"
    },
    {
      "id": "kabe-4",
      "a": "下祇園",
      "b": "古市橋",
      "line": "kabe"
    },
    {
      "id": "kabe-5",
      "a": "古市橋",
      "b": "大町",
      "line": "kabe"
    },
    {
      "id": "kabe-6",
      "a": "大町",
      "b": "緑井",
      "line": "kabe"
    },
    {
      "id": "kabe-7",
      "a": "緑井",
      "b": "七軒茶屋",
      "line": "kabe"
    },
    {
      "id": "kabe-8",
      "a": "七軒茶屋",
      "b": "梅林",
      "line": "kabe"
    },
    {
      "id": "kabe-9",
      "a": "梅林",
      "b": "上八木",
      "line": "kabe",
      "via": [
        [
          3346,
          -304
        ]
      ]
    },
    {
      "id": "kabe-10",
      "a": "上八木",
      "b": "中島",
      "line": "kabe",
      "via": [
        [
          3367,
          -348
        ],
        [
          3385,
          -362
        ]
      ]
    },
    {
      "id": "kabe-11",
      "a": "中島",
      "b": "可部",
      "line": "kabe",
      "via": [
        [
          3394,
          -413
        ]
      ]
    },
    {
      "id": "kabe-12",
      "a": "可部",
      "b": "河戸帆待川",
      "line": "kabe",
      "via": [
        [
          3369,
          -467
        ]
      ]
    },
    {
      "id": "kabe-13",
      "a": "河戸帆待川",
      "b": "あき亀山",
      "line": "kabe"
    },
    {
      "id": "kure-1",
      "a": "海田市",
      "b": "矢野",
      "line": "kure",
      "via": [
        [
          3483,
          334
        ],
        [
          3490,
          345
        ],
        [
          3490,
          421
        ]
      ]
    },
    {
      "id": "kure-2",
      "a": "矢野",
      "b": "坂",
      "line": "kure",
      "via": [
        [
          3457,
          450
        ],
        [
          3423,
          455
        ],
        [
          3400,
          497
        ]
      ]
    },
    {
      "id": "kure-3",
      "a": "坂",
      "b": "水尻",
      "line": "kure",
      "via": [
        [
          3363,
          525
        ],
        [
          3353,
          548
        ],
        [
          3352,
          577
        ],
        [
          3329,
          600
        ]
      ]
    },
    {
      "id": "kure-4",
      "a": "水尻",
      "b": "小屋浦",
      "line": "kure",
      "via": [
        [
          3314,
          646
        ],
        [
          3342,
          704
        ]
      ]
    },
    {
      "id": "kure-5",
      "a": "小屋浦",
      "b": "呉ポートピア",
      "line": "kure",
      "via": [
        [
          3365,
          746
        ]
      ]
    },
    {
      "id": "kure-6",
      "a": "呉ポートピア",
      "b": "天応",
      "line": "kure",
      "via": [
        [
          3412,
          800
        ]
      ]
    },
    {
      "id": "kure-7",
      "a": "天応",
      "b": "かるが浜",
      "line": "kure",
      "via": [
        [
          3398,
          905
        ]
      ]
    },
    {
      "id": "kure-8",
      "a": "かるが浜",
      "b": "吉浦",
      "line": "kure"
    },
    {
      "id": "kure-9",
      "a": "吉浦",
      "b": "川原石",
      "line": "kure",
      "via": [
        [
          3471,
          975
        ],
        [
          3474,
          1017
        ],
        [
          3488,
          1023
        ],
        [
          3505,
          1012
        ]
      ]
    },
    {
      "id": "kure-10",
      "a": "川原石",
      "b": "呉",
      "line": "kure",
      "via": [
        [
          3551,
          1027
        ],
        [
          3578,
          1024
        ]
      ]
    },
    {
      "id": "kure-11",
      "a": "呉",
      "b": "安芸阿賀",
      "line": "kure",
      "via": [
        [
          3619,
          1053
        ],
        [
          3660,
          1054
        ]
      ]
    },
    {
      "id": "kure-12",
      "a": "安芸阿賀",
      "b": "新広",
      "line": "kure"
    },
    {
      "id": "kure-13",
      "a": "新広",
      "b": "広",
      "line": "kure"
    },
    {
      "id": "kure-14",
      "a": "広",
      "b": "仁方",
      "line": "kure",
      "via": [
        [
          3985,
          1148
        ],
        [
          4020,
          1152
        ]
      ]
    },
    {
      "id": "kure-15",
      "a": "仁方",
      "b": "安芸川尻",
      "line": "kure",
      "via": [
        [
          4065,
          1175
        ],
        [
          4097,
          1173
        ],
        [
          4124,
          1195
        ],
        [
          4154,
          1191
        ],
        [
          4175,
          1156
        ],
        [
          4197,
          1142
        ]
      ]
    },
    {
      "id": "kure-16",
      "a": "安芸川尻",
      "b": "安登",
      "line": "kure",
      "via": [
        [
          4211,
          1087
        ],
        [
          4222,
          1076
        ],
        [
          4257,
          1060
        ],
        [
          4282,
          1063
        ],
        [
          4315,
          1048
        ]
      ]
    },
    {
      "id": "kure-17",
      "a": "安登",
      "b": "安浦",
      "line": "kure",
      "via": [
        [
          4371,
          938
        ],
        [
          4372,
          894
        ],
        [
          4410,
          841
        ],
        [
          4413,
          818
        ],
        [
          4425,
          812
        ]
      ]
    },
    {
      "id": "kure-18",
      "a": "安浦",
      "b": "風早",
      "line": "kure",
      "via": [
        [
          4483,
          819
        ],
        [
          4530,
          811
        ],
        [
          4563,
          840
        ],
        [
          4580,
          840
        ],
        [
          4670,
          760
        ]
      ]
    },
    {
      "id": "kure-19",
      "a": "風早",
      "b": "安芸津",
      "line": "kure",
      "via": [
        [
          4680,
          676
        ],
        [
          4691,
          654
        ],
        [
          4740,
          631
        ]
      ]
    },
    {
      "id": "kure-20",
      "a": "安芸津",
      "b": "吉名",
      "line": "kure",
      "via": [
        [
          4822,
          636
        ],
        [
          4865,
          630
        ],
        [
          4928,
          607
        ]
      ]
    },
    {
      "id": "kure-21",
      "a": "吉名",
      "b": "竹原",
      "line": "kure",
      "via": [
        [
          5059,
          589
        ],
        [
          5117,
          544
        ],
        [
          5164,
          519
        ]
      ]
    },
    {
      "id": "kure-22",
      "a": "竹原",
      "b": "大乗",
      "line": "kure",
      "via": [
        [
          5300,
          506
        ],
        [
          5334,
          524
        ]
      ]
    },
    {
      "id": "kure-23",
      "a": "大乗",
      "b": "安芸長浜",
      "line": "kure",
      "via": [
        [
          5406,
          491
        ]
      ]
    },
    {
      "id": "kure-24",
      "a": "安芸長浜",
      "b": "忠海",
      "line": "kure",
      "via": [
        [
          5491,
          525
        ],
        [
          5521,
          540
        ]
      ]
    },
    {
      "id": "kure-25",
      "a": "忠海",
      "b": "安芸幸崎",
      "line": "kure",
      "via": [
        [
          5628,
          519
        ],
        [
          5639,
          528
        ],
        [
          5649,
          558
        ],
        [
          5695,
          568
        ],
        [
          5719,
          555
        ],
        [
          5750,
          552
        ],
        [
          5784,
          523
        ]
      ]
    },
    {
      "id": "kure-26",
      "a": "安芸幸崎",
      "b": "須波",
      "line": "kure",
      "via": [
        [
          5838,
          507
        ],
        [
          5865,
          486
        ],
        [
          5897,
          476
        ],
        [
          5954,
          488
        ],
        [
          5980,
          479
        ],
        [
          5998,
          439
        ]
      ]
    },
    {
      "id": "kure-27",
      "a": "須波",
      "b": "三原",
      "line": "kure",
      "via": [
        [
          6023,
          311
        ],
        [
          6019,
          294
        ],
        [
          6005,
          282
        ],
        [
          5968,
          271
        ],
        [
          5954,
          251
        ],
        [
          5959,
          178
        ],
        [
          5973,
          169
        ]
      ]
    },
    {
      "id": "geibi-1",
      "a": "広島",
      "b": "矢賀",
      "line": "geibi",
      "via": [
        [
          3257,
          207
        ],
        [
          3293,
          209
        ],
        [
          3304,
          203
        ]
      ]
    },
    {
      "id": "geibi-2",
      "a": "矢賀",
      "b": "戸坂",
      "line": "geibi",
      "via": [
        [
          3327,
          155
        ],
        [
          3320,
          83
        ],
        [
          3290,
          16
        ]
      ]
    },
    {
      "id": "geibi-3",
      "a": "戸坂",
      "b": "安芸矢口",
      "line": "geibi",
      "via": [
        [
          3298,
          -152
        ]
      ]
    },
    {
      "id": "geibi-4",
      "a": "安芸矢口",
      "b": "玖村",
      "line": "geibi",
      "via": [
        [
          3311,
          -212
        ]
      ]
    },
    {
      "id": "geibi-5",
      "a": "玖村",
      "b": "下深川",
      "line": "geibi",
      "via": [
        [
          3406,
          -324
        ]
      ]
    },
    {
      "id": "gantoku-1",
      "a": "岩国",
      "b": "西岩国",
      "line": "gantoku",
      "via": [
        [
          2059,
          1463
        ],
        [
          2048,
          1472
        ],
        [
          2034,
          1472
        ],
        [
          2007,
          1453
        ],
        [
          1976,
          1447
        ]
      ]
    },
    {
      "id": "gantoku-2",
      "a": "西岩国",
      "b": "川西",
      "line": "gantoku",
      "via": [
        [
          1909,
          1499
        ],
        [
          1879,
          1496
        ]
      ]
    },
    {
      "id": "gantoku-3",
      "a": "川西",
      "b": "柱野",
      "line": "gantoku",
      "via": [
        [
          1837,
          1539
        ],
        [
          1812,
          1556
        ],
        [
          1754,
          1567
        ]
      ]
    },
    {
      "id": "gantoku-4",
      "a": "柱野",
      "b": "欽明路",
      "line": "gantoku",
      "via": [
        [
          1699,
          1662
        ],
        [
          1638,
          1723
        ],
        [
          1567,
          1777
        ]
      ]
    },
    {
      "id": "gantoku-5",
      "a": "欽明路",
      "b": "玖珂",
      "line": "gantoku",
      "via": [
        [
          1450,
          1839
        ]
      ]
    },
    {
      "id": "gantoku-6",
      "a": "玖珂",
      "b": "周防高森",
      "line": "gantoku",
      "via": [
        [
          1333,
          1882
        ],
        [
          1275,
          1879
        ]
      ]
    },
    {
      "id": "gantoku-7",
      "a": "周防高森",
      "b": "米川",
      "line": "gantoku",
      "via": [
        [
          1193,
          1888
        ],
        [
          1159,
          1902
        ],
        [
          1122,
          1962
        ]
      ]
    },
    {
      "id": "gantoku-8",
      "a": "米川",
      "b": "高水",
      "line": "gantoku"
    },
    {
      "id": "gantoku-9",
      "a": "高水",
      "b": "勝間",
      "line": "gantoku",
      "via": [
        [
          877,
          2103
        ]
      ]
    },
    {
      "id": "gantoku-10",
      "a": "勝間",
      "b": "大河内",
      "line": "gantoku"
    },
    {
      "id": "gantoku-11",
      "a": "大河内",
      "b": "周防久保",
      "line": "gantoku",
      "via": [
        [
          695,
          2218
        ]
      ]
    },
    {
      "id": "gantoku-12",
      "a": "周防久保",
      "b": "生野屋",
      "line": "gantoku",
      "via": [
        [
          639,
          2230
        ],
        [
          613,
          2215
        ],
        [
          578,
          2216
        ],
        [
          540,
          2191
        ]
      ]
    },
    {
      "id": "gantoku-13",
      "a": "生野屋",
      "b": "周防花岡",
      "line": "gantoku"
    },
    {
      "id": "gantoku-14",
      "a": "周防花岡",
      "b": "櫛ケ浜",
      "line": "gantoku",
      "via": [
        [
          374,
          2217
        ],
        [
          342,
          2217
        ],
        [
          278,
          2234
        ],
        [
          258,
          2230
        ]
      ]
    },
    {
      "id": "seiryu-1",
      "a": "川西",
      "b": "清流新岩国",
      "line": "seiryu",
      "via": [
        [
          1837,
          1539
        ],
        [
          1812,
          1556
        ],
        [
          1777,
          1564
        ],
        [
          1755,
          1562
        ],
        [
          1738,
          1549
        ]
      ]
    },
    {
      "id": "seiryu-2",
      "a": "清流新岩国",
      "b": "守内かさ神",
      "line": "seiryu",
      "via": [
        [
          1701,
          1474
        ]
      ]
    },
    {
      "id": "seiryu-3",
      "a": "守内かさ神",
      "b": "南河内",
      "line": "seiryu",
      "via": [
        [
          1639,
          1439
        ],
        [
          1558,
          1441
        ],
        [
          1529,
          1451
        ]
      ]
    },
    {
      "id": "seiryu-4",
      "a": "南河内",
      "b": "行波",
      "line": "seiryu",
      "via": [
        [
          1471,
          1526
        ],
        [
          1446,
          1518
        ]
      ]
    },
    {
      "id": "seiryu-5",
      "a": "行波",
      "b": "北河内",
      "line": "seiryu",
      "via": [
        [
          1416,
          1464
        ],
        [
          1377,
          1452
        ],
        [
          1356,
          1421
        ]
      ]
    },
    {
      "id": "seiryu-6",
      "a": "北河内",
      "b": "椋野",
      "line": "seiryu",
      "via": [
        [
          1309,
          1404
        ],
        [
          1282,
          1400
        ],
        [
          1267,
          1371
        ],
        [
          1209,
          1356
        ]
      ]
    },
    {
      "id": "seiryu-7",
      "a": "椋野",
      "b": "南桑",
      "line": "seiryu",
      "via": [
        [
          1172,
          1292
        ],
        [
          1187,
          1270
        ],
        [
          1185,
          1241
        ],
        [
          1172,
          1230
        ],
        [
          1146,
          1239
        ]
      ]
    },
    {
      "id": "seiryu-8",
      "a": "南桑",
      "b": "根笠",
      "line": "seiryu",
      "via": [
        [
          1103,
          1207
        ],
        [
          1076,
          1228
        ],
        [
          1044,
          1210
        ],
        [
          1033,
          1213
        ]
      ]
    },
    {
      "id": "seiryu-9",
      "a": "根笠",
      "b": "河山",
      "line": "seiryu",
      "via": [
        [
          1011,
          1244
        ],
        [
          993,
          1233
        ],
        [
          987,
          1183
        ],
        [
          949,
          1138
        ],
        [
          944,
          1100
        ]
      ]
    },
    {
      "id": "seiryu-10",
      "a": "河山",
      "b": "柳瀬",
      "line": "seiryu",
      "via": [
        [
          972,
          1074
        ],
        [
          973,
          1066
        ],
        [
          958,
          1043
        ],
        [
          925,
          1025
        ]
      ]
    },
    {
      "id": "seiryu-11",
      "a": "柳瀬",
      "b": "錦町",
      "line": "seiryu",
      "via": [
        [
          921,
          944
        ]
      ]
    },
    {
      "id": "sanyo-e1",
      "a": "三原",
      "b": "糸崎",
      "line": "sanyo",
      "via": [
        [
          6047,
          172
        ],
        [
          6079,
          204
        ]
      ]
    },
    {
      "id": "sanyo-e2",
      "a": "糸崎",
      "b": "尾道",
      "line": "sanyo",
      "via": [
        [
          6136,
          232
        ],
        [
          6167,
          266
        ],
        [
          6207,
          266
        ],
        [
          6236,
          252
        ],
        [
          6288,
          213
        ],
        [
          6361,
          196
        ],
        [
          6443,
          162
        ]
      ]
    },
    {
      "id": "sanyo-e3",
      "a": "尾道",
      "b": "東尾道",
      "line": "sanyo",
      "via": [
        [
          6541,
          129
        ],
        [
          6568,
          102
        ],
        [
          6612,
          109
        ],
        [
          6636,
          120
        ],
        [
          6671,
          108
        ],
        [
          6683,
          88
        ],
        [
          6676,
          15
        ]
      ]
    },
    {
      "id": "sanyo-e4",
      "a": "東尾道",
      "b": "松永",
      "line": "sanyo",
      "via": [
        [
          6717,
          -51
        ]
      ]
    },
    {
      "id": "sanyo-e5",
      "a": "松永",
      "b": "備後赤坂",
      "line": "sanyo",
      "via": [
        [
          6967,
          -186
        ]
      ]
    },
    {
      "id": "sanyo-e6",
      "a": "備後赤坂",
      "b": "福山",
      "line": "sanyo",
      "via": [
        [
          7116,
          -291
        ],
        [
          7215,
          -317
        ]
      ]
    },
    {
      "id": "sanyo-e7",
      "a": "福山",
      "b": "東福山",
      "line": "sanyo",
      "via": [
        [
          7341,
          -337
        ],
        [
          7418,
          -340
        ]
      ]
    },
    {
      "id": "sanyo-e8",
      "a": "東福山",
      "b": "大門",
      "line": "sanyo",
      "via": [
        [
          7563,
          -375
        ],
        [
          7597,
          -399
        ]
      ]
    },
    {
      "id": "sanyo-e9",
      "a": "大門",
      "b": "笠岡",
      "line": "sanyo",
      "via": [
        [
          7688,
          -384
        ],
        [
          7760,
          -430
        ],
        [
          7797,
          -466
        ],
        [
          7817,
          -475
        ],
        [
          7845,
          -474
        ],
        [
          7865,
          -458
        ],
        [
          7889,
          -451
        ]
      ]
    },
    {
      "id": "sanyo-e10",
      "a": "笠岡",
      "b": "里庄",
      "line": "sanyo",
      "via": [
        [
          7973,
          -384
        ],
        [
          8033,
          -380
        ],
        [
          8077,
          -389
        ],
        [
          8102,
          -412
        ],
        [
          8134,
          -415
        ]
      ]
    },
    {
      "id": "sanyo-e11",
      "a": "里庄",
      "b": "鴨方",
      "line": "sanyo"
    },
    {
      "id": "sanyo-e12",
      "a": "鴨方",
      "b": "金光",
      "line": "sanyo",
      "via": [
        [
          8350,
          -550
        ],
        [
          8371,
          -578
        ]
      ]
    },
    {
      "id": "sanyo-e13",
      "a": "金光",
      "b": "新倉敷",
      "line": "sanyo",
      "via": [
        [
          8506,
          -617
        ],
        [
          8574,
          -614
        ]
      ]
    },
    {
      "id": "sanyo-e14",
      "a": "新倉敷",
      "b": "西阿知",
      "line": "sanyo",
      "via": [
        [
          8862,
          -840
        ],
        [
          8929,
          -838
        ]
      ]
    },
    {
      "id": "sanyo-e15",
      "a": "西阿知",
      "b": "倉敷",
      "line": "sanyo",
      "via": [
        [
          9012,
          -883
        ],
        [
          9074,
          -899
        ],
        [
          9110,
          -919
        ]
      ]
    },
    {
      "id": "sanyo-e16",
      "a": "倉敷",
      "b": "中庄",
      "line": "sanyo",
      "via": [
        [
          9260,
          -1051
        ]
      ]
    },
    {
      "id": "sanyo-e17",
      "a": "中庄",
      "b": "庭瀬",
      "line": "sanyo",
      "via": [
        [
          9495,
          -1142
        ]
      ]
    },
    {
      "id": "sanyo-e18",
      "a": "庭瀬",
      "b": "北長瀬",
      "line": "sanyo"
    },
    {
      "id": "sanyo-e19",
      "a": "北長瀬",
      "b": "岡山",
      "line": "sanyo",
      "via": [
        [
          9815,
          -1279
        ]
      ]
    },
    {
      "id": "seto-1",
      "a": "岡山",
      "b": "大元",
      "line": "seto",
      "via": [
        [
          9806,
          -1271
        ]
      ]
    },
    {
      "id": "seto-2",
      "a": "大元",
      "b": "備前西市",
      "line": "seto",
      "via": [
        [
          9804,
          -1167
        ]
      ]
    },
    {
      "id": "seto-3",
      "a": "備前西市",
      "b": "妹尾",
      "line": "seto",
      "via": [
        [
          9671,
          -1009
        ]
      ]
    },
    {
      "id": "seto-4",
      "a": "妹尾",
      "b": "備中箕島",
      "line": "seto",
      "via": [
        [
          9610,
          -976
        ]
      ]
    },
    {
      "id": "seto-5",
      "a": "備中箕島",
      "b": "早島",
      "line": "seto",
      "via": [
        [
          9474,
          -962
        ]
      ]
    },
    {
      "id": "seto-6",
      "a": "早島",
      "b": "久々原",
      "line": "seto",
      "via": [
        [
          9434,
          -932
        ]
      ]
    },
    {
      "id": "seto-7",
      "a": "久々原",
      "b": "茶屋町",
      "line": "seto"
    },
    {
      "id": "seto-8",
      "a": "茶屋町",
      "b": "植松",
      "line": "seto",
      "via": [
        [
          9409,
          -735
        ],
        [
          9422,
          -702
        ]
      ]
    },
    {
      "id": "seto-9",
      "a": "植松",
      "b": "木見",
      "line": "seto"
    },
    {
      "id": "seto-10",
      "a": "木見",
      "b": "上の町",
      "line": "seto",
      "via": [
        [
          9395,
          -482
        ],
        [
          9385,
          -385
        ]
      ]
    },
    {
      "id": "seto-11",
      "a": "上の町",
      "b": "児島",
      "line": "seto"
    },
    {
      "id": "shinkansen-1",
      "a": "博多",
      "b": "小倉",
      "line": "shinkansen",
      "via": [
        [
          -6211,
          4588
        ],
        [
          -6210,
          4586
        ],
        [
          -6201,
          4583
        ],
        [
          -6195,
          4578
        ],
        [
          -6193,
          4572
        ],
        [
          -6193,
          4569
        ],
        [
          -6195,
          4564
        ],
        [
          -6177,
          4541
        ],
        [
          -6042,
          4446
        ],
        [
          -5940,
          4336
        ],
        [
          -5814,
          4218
        ],
        [
          -5478,
          3990
        ],
        [
          -5389,
          3908
        ],
        [
          -5325,
          3874
        ],
        [
          -5215,
          3838
        ],
        [
          -5160,
          3812
        ],
        [
          -5116,
          3779
        ],
        [
          -5016,
          3673
        ],
        [
          -4985,
          3649
        ],
        [
          -4934,
          3617
        ],
        [
          -4837,
          3586
        ],
        [
          -4789,
          3558
        ],
        [
          -4657,
          3375
        ],
        [
          -4564,
          3278
        ],
        [
          -4365,
          3132
        ],
        [
          -4256,
          3031
        ],
        [
          -4197,
          3003
        ],
        [
          -4154,
          3005
        ],
        [
          -4149,
          3000
        ],
        [
          -4143,
          2996
        ],
        [
          -4138,
          2995
        ],
        [
          -4133,
          2997
        ],
        [
          -4129,
          3000
        ],
        [
          -4126,
          3005
        ],
        [
          -4123,
          3011
        ]
      ]
    },
    {
      "id": "shinkansen-2",
      "a": "小倉",
      "b": "新下関",
      "line": "shinkansen",
      "via": [
        [
          -4019,
          3042
        ],
        [
          -3920,
          3040
        ],
        [
          -3867,
          3026
        ],
        [
          -3807,
          2982
        ],
        [
          -3693,
          2848
        ],
        [
          -3673,
          2814
        ],
        [
          -3659,
          2752
        ],
        [
          -3663,
          2699
        ],
        [
          -3682,
          2656
        ],
        [
          -3789,
          2485
        ],
        [
          -3803,
          2419
        ]
      ]
    },
    {
      "id": "shinkansen-3",
      "a": "新下関",
      "b": "厚狭",
      "line": "shinkansen",
      "via": [
        [
          -3768,
          2246
        ],
        [
          -3704,
          2133
        ],
        [
          -3675,
          2094
        ],
        [
          -3615,
          2052
        ],
        [
          -3438,
          1983
        ],
        [
          -3392,
          1974
        ],
        [
          -3339,
          1973
        ],
        [
          -2998,
          2021
        ],
        [
          -2942,
          2039
        ]
      ]
    },
    {
      "id": "shinkansen-4",
      "a": "厚狭",
      "b": "新山口",
      "line": "shinkansen",
      "via": [
        [
          -2729,
          2134
        ],
        [
          -2465,
          2185
        ],
        [
          -2393,
          2185
        ],
        [
          -2326,
          2174
        ],
        [
          -2166,
          2116
        ],
        [
          -2123,
          2110
        ],
        [
          -2025,
          2109
        ],
        [
          -1972,
          2091
        ],
        [
          -1924,
          2056
        ],
        [
          -1849,
          1965
        ]
      ]
    },
    {
      "id": "shinkansen-5",
      "a": "新山口",
      "b": "徳山",
      "line": "shinkansen",
      "via": [
        [
          -1659,
          1830
        ],
        [
          -1617,
          1820
        ],
        [
          -1582,
          1819
        ],
        [
          -1526,
          1833
        ],
        [
          -1293,
          1930
        ],
        [
          -1092,
          1961
        ],
        [
          -798,
          1992
        ],
        [
          -744,
          1990
        ],
        [
          -470,
          1946
        ],
        [
          -341,
          1941
        ],
        [
          -101,
          1883
        ],
        [
          -56,
          1883
        ],
        [
          4,
          1900
        ],
        [
          60,
          1946
        ],
        [
          89,
          2004
        ],
        [
          111,
          2086
        ]
      ]
    },
    {
      "id": "shinkansen-6",
      "a": "徳山",
      "b": "新岩国",
      "line": "shinkansen",
      "via": [
        [
          147,
          2137
        ],
        [
          219,
          2182
        ],
        [
          257,
          2197
        ],
        [
          305,
          2205
        ],
        [
          409,
          2194
        ],
        [
          414,
          2203
        ],
        [
          419,
          2207
        ],
        [
          423,
          2207
        ],
        [
          426,
          2207
        ],
        [
          427,
          2207
        ],
        [
          432,
          2205
        ],
        [
          437,
          2198
        ],
        [
          500,
          2198
        ],
        [
          505,
          2205
        ],
        [
          510,
          2208
        ],
        [
          518,
          2209
        ],
        [
          522,
          2207
        ],
        [
          526,
          2204
        ],
        [
          529,
          2197
        ],
        [
          532,
          2193
        ],
        [
          612,
          2180
        ],
        [
          693,
          2178
        ],
        [
          742,
          2164
        ],
        [
          783,
          2137
        ],
        [
          849,
          2078
        ],
        [
          956,
          2017
        ],
        [
          1085,
          1915
        ],
        [
          1124,
          1893
        ],
        [
          1180,
          1871
        ],
        [
          1444,
          1811
        ],
        [
          1517,
          1779
        ],
        [
          1564,
          1743
        ],
        [
          1600,
          1703
        ],
        [
          1707,
          1504
        ],
        [
          1716,
          1503
        ],
        [
          1720,
          1500
        ],
        [
          1723,
          1496
        ],
        [
          1724,
          1492
        ],
        [
          1724,
          1493
        ],
        [
          1724,
          1487
        ],
        [
          1720,
          1479
        ]
      ]
    },
    {
      "id": "shinkansen-7",
      "a": "新岩国",
      "b": "広島",
      "line": "shinkansen",
      "via": [
        [
          1724,
          1468
        ],
        [
          1909,
          1098
        ],
        [
          2180,
          830
        ],
        [
          2309,
          724
        ],
        [
          2342,
          689
        ],
        [
          2482,
          443
        ],
        [
          2554,
          294
        ],
        [
          2595,
          243
        ],
        [
          2659,
          199
        ],
        [
          2717,
          179
        ],
        [
          2860,
          146
        ],
        [
          3084,
          120
        ],
        [
          3087,
          119
        ],
        [
          3090,
          123
        ],
        [
          3092,
          126
        ],
        [
          3096,
          128
        ],
        [
          3101,
          129
        ],
        [
          3105,
          129
        ],
        [
          3106,
          128
        ],
        [
          3111,
          125
        ],
        [
          3117,
          117
        ],
        [
          3134,
          120
        ],
        [
          3135,
          124
        ],
        [
          3135,
          126
        ],
        [
          3136,
          131
        ],
        [
          3137,
          132
        ],
        [
          3139,
          135
        ],
        [
          3141,
          137
        ],
        [
          3144,
          139
        ],
        [
          3147,
          139
        ],
        [
          3150,
          140
        ],
        [
          3152,
          139
        ],
        [
          3153,
          139
        ],
        [
          3155,
          138
        ],
        [
          3158,
          137
        ],
        [
          3163,
          133
        ]
      ]
    },
    {
      "id": "shinkansen-8",
      "a": "広島",
      "b": "東広島",
      "line": "shinkansen",
      "via": [
        [
          3243,
          201
        ],
        [
          3312,
          216
        ],
        [
          3315,
          216
        ],
        [
          3318,
          216
        ],
        [
          3322,
          217
        ],
        [
          3325,
          218
        ],
        [
          3330,
          224
        ],
        [
          3331,
          224
        ],
        [
          3333,
          225
        ],
        [
          3420,
          253
        ],
        [
          3574,
          267
        ],
        [
          3615,
          276
        ],
        [
          3908,
          469
        ],
        [
          3947,
          484
        ],
        [
          3998,
          491
        ],
        [
          4153,
          477
        ],
        [
          4235,
          454
        ],
        [
          4360,
          374
        ],
        [
          4466,
          275
        ]
      ]
    },
    {
      "id": "shinkansen-9",
      "a": "東広島",
      "b": "三原",
      "line": "shinkansen",
      "via": [
        [
          4635,
          151
        ],
        [
          4674,
          133
        ],
        [
          4719,
          122
        ],
        [
          5127,
          124
        ],
        [
          5503,
          72
        ],
        [
          5562,
          76
        ],
        [
          5613,
          87
        ],
        [
          5760,
          160
        ],
        [
          5813,
          177
        ],
        [
          5864,
          181
        ]
      ]
    },
    {
      "id": "shinkansen-10",
      "a": "三原",
      "b": "新尾道",
      "line": "shinkansen",
      "via": [
        [
          6099,
          167
        ],
        [
          6170,
          154
        ]
      ]
    },
    {
      "id": "shinkansen-11",
      "a": "新尾道",
      "b": "福山",
      "line": "shinkansen",
      "via": [
        [
          6580,
          -35
        ],
        [
          6677,
          -112
        ],
        [
          6747,
          -152
        ],
        [
          7084,
          -287
        ],
        [
          7193,
          -315
        ]
      ]
    },
    {
      "id": "shinkansen-12",
      "a": "福山",
      "b": "新倉敷",
      "line": "shinkansen",
      "via": [
        [
          7341,
          -337
        ],
        [
          7415,
          -341
        ],
        [
          7474,
          -354
        ],
        [
          7477,
          -354
        ],
        [
          7479,
          -362
        ],
        [
          7483,
          -366
        ],
        [
          7485,
          -368
        ],
        [
          7489,
          -369
        ],
        [
          7490,
          -370
        ],
        [
          7494,
          -370
        ],
        [
          7501,
          -366
        ],
        [
          7509,
          -362
        ],
        [
          7578,
          -382
        ],
        [
          7738,
          -481
        ],
        [
          7845,
          -525
        ],
        [
          7899,
          -538
        ],
        [
          8127,
          -571
        ],
        [
          8319,
          -652
        ],
        [
          8371,
          -667
        ],
        [
          8446,
          -667
        ],
        [
          8549,
          -653
        ],
        [
          8600,
          -658
        ],
        [
          8658,
          -681
        ]
      ]
    },
    {
      "id": "shinkansen-13",
      "a": "新倉敷",
      "b": "岡山",
      "line": "shinkansen",
      "via": [
        [
          8811,
          -807
        ],
        [
          8885,
          -923
        ],
        [
          9057,
          -1076
        ],
        [
          9105,
          -1106
        ],
        [
          9472,
          -1231
        ],
        [
          9793,
          -1268
        ],
        [
          9828,
          -1285
        ]
      ]
    },
    {
      "id": "shinkansen-14",
      "a": "岡山",
      "b": "相生",
      "line": "shinkansen",
      "via": [
        [
          9867,
          -1363
        ],
        [
          9891,
          -1383
        ],
        [
          10156,
          -1413
        ],
        [
          10200,
          -1424
        ],
        [
          10399,
          -1540
        ],
        [
          10526,
          -1586
        ],
        [
          10801,
          -1663
        ],
        [
          11032,
          -1765
        ],
        [
          11073,
          -1774
        ],
        [
          11285,
          -1792
        ],
        [
          11622,
          -1918
        ],
        [
          11851,
          -1932
        ],
        [
          11927,
          -1949
        ],
        [
          11996,
          -1980
        ],
        [
          12238,
          -2133
        ],
        [
          12314,
          -2151
        ]
      ]
    },
    {
      "id": "shinkansen-15",
      "a": "相生",
      "b": "姫路",
      "line": "shinkansen",
      "via": [
        [
          12466,
          -2144
        ],
        [
          12595,
          -2155
        ],
        [
          12739,
          -2205
        ],
        [
          12794,
          -2214
        ],
        [
          12963,
          -2201
        ],
        [
          13143,
          -2219
        ]
      ]
    },
    {
      "id": "shinkansen-16",
      "a": "姫路",
      "b": "西明石",
      "line": "shinkansen",
      "via": [
        [
          13527,
          -2172
        ],
        [
          13586,
          -2144
        ],
        [
          13639,
          -2103
        ],
        [
          13758,
          -1972
        ],
        [
          13826,
          -1920
        ],
        [
          13936,
          -1818
        ],
        [
          14178,
          -1620
        ],
        [
          14269,
          -1539
        ],
        [
          14364,
          -1478
        ],
        [
          14507,
          -1346
        ],
        [
          14546,
          -1324
        ]
      ]
    },
    {
      "id": "shinkansen-17",
      "a": "西明石",
      "b": "新神戸",
      "line": "shinkansen",
      "via": [
        [
          14771,
          -1296
        ],
        [
          14824,
          -1299
        ],
        [
          15179,
          -1386
        ],
        [
          15474,
          -1472
        ],
        [
          15670,
          -1511
        ]
      ]
    },
    {
      "id": "shinkansen-18",
      "a": "新神戸",
      "b": "新大阪",
      "line": "shinkansen",
      "via": [
        [
          15833,
          -1658
        ],
        [
          15905,
          -1711
        ],
        [
          16251,
          -1844
        ],
        [
          16318,
          -1859
        ],
        [
          16446,
          -1849
        ],
        [
          16648,
          -1872
        ],
        [
          16714,
          -1868
        ],
        [
          16773,
          -1844
        ],
        [
          16823,
          -1801
        ],
        [
          16845,
          -1768
        ],
        [
          16900,
          -1649
        ],
        [
          16929,
          -1622
        ],
        [
          16958,
          -1621
        ]
      ]
    },
    {
      "id": "tokaido-1",
      "a": "新大阪",
      "b": "京都",
      "line": "tokaido",
      "via": [
        [
          17145,
          -1697
        ],
        [
          17183,
          -1736
        ],
        [
          17258,
          -1752
        ],
        [
          17300,
          -1775
        ],
        [
          17572,
          -2047
        ],
        [
          17801,
          -2390
        ],
        [
          17932,
          -2542
        ],
        [
          17933,
          -2542
        ],
        [
          17936,
          -2546
        ],
        [
          17939,
          -2548
        ],
        [
          17941,
          -2551
        ],
        [
          17942,
          -2554
        ],
        [
          17942,
          -2555
        ],
        [
          17943,
          -2556
        ],
        [
          17944,
          -2557
        ],
        [
          17988,
          -2609
        ],
        [
          18056,
          -2658
        ],
        [
          18080,
          -2695
        ],
        [
          18089,
          -2734
        ],
        [
          18093,
          -2928
        ],
        [
          18100,
          -2972
        ],
        [
          18122,
          -3015
        ],
        [
          18158,
          -3041
        ],
        [
          18167,
          -3036
        ],
        [
          18175,
          -3038
        ],
        [
          18179,
          -3040
        ],
        [
          18182,
          -3044
        ],
        [
          18183,
          -3049
        ],
        [
          18183,
          -3050
        ],
        [
          18184,
          -3056
        ],
        [
          18228,
          -3071
        ]
      ]
    },
    {
      "id": "tokaido-2",
      "a": "京都",
      "b": "米原",
      "line": "tokaido",
      "via": [
        [
          18350,
          -3075
        ],
        [
          18475,
          -3053
        ],
        [
          18574,
          -3049
        ],
        [
          19000,
          -2986
        ],
        [
          19040,
          -2989
        ],
        [
          19087,
          -3011
        ],
        [
          19230,
          -3152
        ],
        [
          19328,
          -3285
        ],
        [
          19515,
          -3511
        ],
        [
          19545,
          -3539
        ],
        [
          19707,
          -3662
        ],
        [
          20154,
          -3892
        ],
        [
          20266,
          -3966
        ],
        [
          20296,
          -3993
        ],
        [
          20436,
          -4216
        ],
        [
          20614,
          -4453
        ],
        [
          20679,
          -4608
        ],
        [
          20701,
          -4804
        ]
      ]
    },
    {
      "id": "tokaido-3",
      "a": "米原",
      "b": "岐阜羽島",
      "line": "tokaido",
      "via": [
        [
          20758,
          -5014
        ],
        [
          20824,
          -5101
        ],
        [
          20862,
          -5124
        ],
        [
          20953,
          -5150
        ],
        [
          21042,
          -5186
        ],
        [
          21075,
          -5192
        ],
        [
          21127,
          -5191
        ],
        [
          21237,
          -5164
        ],
        [
          21416,
          -5149
        ],
        [
          21512,
          -5132
        ],
        [
          21570,
          -5143
        ],
        [
          21685,
          -5196
        ],
        [
          21730,
          -5205
        ],
        [
          21813,
          -5190
        ],
        [
          21845,
          -5173
        ],
        [
          21919,
          -5118
        ],
        [
          21964,
          -5099
        ],
        [
          22141,
          -5089
        ],
        [
          22319,
          -5072
        ],
        [
          22348,
          -5064
        ],
        [
          22448,
          -5013
        ]
      ]
    },
    {
      "id": "tokaido-4",
      "a": "岐阜羽島",
      "b": "名古屋",
      "line": "tokaido",
      "via": [
        [
          22606,
          -4856
        ],
        [
          22781,
          -4767
        ],
        [
          22812,
          -4745
        ],
        [
          22940,
          -4531
        ],
        [
          22973,
          -4494
        ],
        [
          23097,
          -4422
        ],
        [
          23204,
          -4400
        ],
        [
          23250,
          -4376
        ],
        [
          23311,
          -4300
        ],
        [
          23359,
          -4259
        ],
        [
          23387,
          -4200
        ],
        [
          23432,
          -4146
        ]
      ]
    },
    {
      "id": "tokaido-5",
      "a": "名古屋",
      "b": "三河安城",
      "line": "tokaido",
      "via": [
        [
          23467,
          -4064
        ],
        [
          23480,
          -4004
        ],
        [
          23469,
          -3893
        ],
        [
          23482,
          -3842
        ],
        [
          23516,
          -3799
        ],
        [
          23612,
          -3743
        ],
        [
          23646,
          -3709
        ],
        [
          23733,
          -3516
        ],
        [
          23793,
          -3407
        ],
        [
          23838,
          -3362
        ],
        [
          24179,
          -3094
        ],
        [
          24216,
          -3057
        ]
      ]
    },
    {
      "id": "tokaido-6",
      "a": "三河安城",
      "b": "豊橋",
      "line": "tokaido",
      "via": [
        [
          24742,
          -2373
        ],
        [
          25051,
          -2230
        ],
        [
          25129,
          -2170
        ],
        [
          25172,
          -2146
        ],
        [
          25217,
          -2132
        ],
        [
          25329,
          -2128
        ],
        [
          25375,
          -2115
        ],
        [
          25474,
          -2050
        ],
        [
          25658,
          -1957
        ],
        [
          25719,
          -1894
        ]
      ]
    },
    {
      "id": "tokaido-7",
      "a": "豊橋",
      "b": "浜松",
      "line": "tokaido",
      "via": [
        [
          25770,
          -1787
        ],
        [
          25798,
          -1750
        ],
        [
          25923,
          -1660
        ],
        [
          26451,
          -1510
        ],
        [
          26578,
          -1468
        ],
        [
          26613,
          -1461
        ],
        [
          26713,
          -1460
        ],
        [
          26811,
          -1420
        ],
        [
          26956,
          -1422
        ],
        [
          27056,
          -1451
        ],
        [
          27111,
          -1459
        ],
        [
          27267,
          -1451
        ],
        [
          27313,
          -1467
        ]
      ]
    },
    {
      "id": "tokaido-8",
      "a": "浜松",
      "b": "掛川",
      "line": "tokaido",
      "via": [
        [
          27417,
          -1529
        ],
        [
          27477,
          -1538
        ],
        [
          27578,
          -1540
        ],
        [
          27622,
          -1536
        ],
        [
          27732,
          -1507
        ],
        [
          27805,
          -1508
        ],
        [
          27989,
          -1540
        ],
        [
          28028,
          -1559
        ],
        [
          28084,
          -1612
        ],
        [
          28129,
          -1644
        ],
        [
          28249,
          -1701
        ],
        [
          28324,
          -1748
        ],
        [
          28403,
          -1777
        ],
        [
          28571,
          -1854
        ],
        [
          28614,
          -1869
        ]
      ]
    },
    {
      "id": "tokaido-9",
      "a": "掛川",
      "b": "静岡",
      "line": "tokaido",
      "via": [
        [
          28754,
          -1903
        ],
        [
          28869,
          -1887
        ],
        [
          28947,
          -1890
        ],
        [
          29062,
          -1904
        ],
        [
          29542,
          -2073
        ],
        [
          29990,
          -2438
        ],
        [
          30072,
          -2515
        ],
        [
          30205,
          -2676
        ],
        [
          30242,
          -2735
        ],
        [
          30254,
          -2774
        ],
        [
          30257,
          -2848
        ],
        [
          30271,
          -2885
        ],
        [
          30339,
          -2971
        ]
      ]
    },
    {
      "id": "tokaido-10",
      "a": "静岡",
      "b": "新富士",
      "line": "tokaido",
      "via": [
        [
          30451,
          -3043
        ],
        [
          30681,
          -3223
        ],
        [
          30791,
          -3335
        ],
        [
          30870,
          -3397
        ],
        [
          31056,
          -3657
        ],
        [
          31134,
          -3754
        ],
        [
          31157,
          -3774
        ],
        [
          31398,
          -3908
        ]
      ]
    },
    {
      "id": "tokaido-11",
      "a": "新富士",
      "b": "三島",
      "line": "tokaido",
      "via": [
        [
          31701,
          -3957
        ],
        [
          31786,
          -3988
        ],
        [
          32059,
          -4021
        ],
        [
          32097,
          -4015
        ],
        [
          32311,
          -3941
        ],
        [
          32386,
          -3877
        ],
        [
          32426,
          -3859
        ],
        [
          32643,
          -3837
        ]
      ]
    },
    {
      "id": "tokaido-12",
      "a": "三島",
      "b": "熱海",
      "line": "tokaido",
      "via": [
        [
          32818,
          -3867
        ],
        [
          32859,
          -3860
        ],
        [
          32953,
          -3805
        ],
        [
          33075,
          -3758
        ],
        [
          33473,
          -3706
        ],
        [
          33506,
          -3712
        ]
      ]
    },
    {
      "id": "tokaido-13",
      "a": "熱海",
      "b": "小田原",
      "line": "tokaido",
      "via": [
        [
          33563,
          -3771
        ],
        [
          33608,
          -3933
        ],
        [
          33740,
          -4106
        ],
        [
          33786,
          -4181
        ],
        [
          33799,
          -4225
        ],
        [
          33823,
          -4432
        ],
        [
          33850,
          -4511
        ]
      ]
    },
    {
      "id": "tokaido-14",
      "a": "小田原",
      "b": "新横浜",
      "line": "tokaido",
      "via": [
        [
          33976,
          -4677
        ],
        [
          34016,
          -4710
        ],
        [
          34225,
          -4826
        ],
        [
          34420,
          -4896
        ],
        [
          34500,
          -4951
        ],
        [
          34569,
          -5024
        ],
        [
          34650,
          -5127
        ],
        [
          34855,
          -5304
        ],
        [
          35302,
          -5545
        ],
        [
          35562,
          -5658
        ],
        [
          35779,
          -5810
        ],
        [
          35902,
          -5859
        ]
      ]
    },
    {
      "id": "tokaido-15",
      "a": "新横浜",
      "b": "品川",
      "line": "tokaido",
      "via": [
        [
          36073,
          -6029
        ],
        [
          36221,
          -6281
        ],
        [
          36232,
          -6310
        ],
        [
          36225,
          -6346
        ],
        [
          36232,
          -6364
        ],
        [
          36294,
          -6394
        ],
        [
          36475,
          -6457
        ],
        [
          36530,
          -6567
        ],
        [
          36565,
          -6588
        ]
      ]
    },
    {
      "id": "tokaido-16",
      "a": "品川",
      "b": "東京",
      "line": "tokaido",
      "via": [
        [
          36601,
          -6728
        ],
        [
          36639,
          -6751
        ],
        [
          36652,
          -6767
        ],
        [
          36665,
          -6827
        ],
        [
          36664,
          -6866
        ]
      ]
    },
    {
      "id": "kagoshima-1",
      "a": "博多",
      "b": "吉塚",
      "line": "kagoshima",
      "via": [
        [
          -6218,
          4607
        ]
      ]
    },
    {
      "id": "kagoshima-2",
      "a": "吉塚",
      "b": "箱崎",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-3",
      "a": "箱崎",
      "b": "千早",
      "line": "kagoshima",
      "via": [
        [
          -6190,
          4484
        ],
        [
          -6194,
          4407
        ],
        [
          -6183,
          4387
        ],
        [
          -6146,
          4360
        ]
      ]
    },
    {
      "id": "kagoshima-4",
      "a": "千早",
      "b": "香椎",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-5",
      "a": "香椎",
      "b": "九産大前",
      "line": "kagoshima",
      "via": [
        [
          -6113,
          4250
        ]
      ]
    },
    {
      "id": "kagoshima-6",
      "a": "九産大前",
      "b": "福工大前",
      "line": "kagoshima",
      "via": [
        [
          -6152,
          4156
        ],
        [
          -6157,
          4110
        ]
      ]
    },
    {
      "id": "kagoshima-7",
      "a": "福工大前",
      "b": "新宮中央",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-8",
      "a": "新宮中央",
      "b": "ししぶ",
      "line": "kagoshima",
      "via": [
        [
          -6072,
          3958
        ]
      ]
    },
    {
      "id": "kagoshima-9",
      "a": "ししぶ",
      "b": "古賀",
      "line": "kagoshima",
      "via": [
        [
          -6034,
          3924
        ]
      ]
    },
    {
      "id": "kagoshima-10",
      "a": "古賀",
      "b": "千鳥",
      "line": "kagoshima",
      "via": [
        [
          -5988,
          3817
        ]
      ]
    },
    {
      "id": "kagoshima-11",
      "a": "千鳥",
      "b": "福間",
      "line": "kagoshima",
      "via": [
        [
          -5939,
          3722
        ]
      ]
    },
    {
      "id": "kagoshima-12",
      "a": "福間",
      "b": "東福間",
      "line": "kagoshima",
      "via": [
        [
          -5881,
          3675
        ],
        [
          -5837,
          3667
        ]
      ]
    },
    {
      "id": "kagoshima-13",
      "a": "東福間",
      "b": "東郷",
      "line": "kagoshima",
      "via": [
        [
          -5785,
          3631
        ],
        [
          -5760,
          3630
        ],
        [
          -5749,
          3624
        ],
        [
          -5744,
          3559
        ]
      ]
    },
    {
      "id": "kagoshima-14",
      "a": "東郷",
      "b": "赤間",
      "line": "kagoshima",
      "via": [
        [
          -5580,
          3456
        ]
      ]
    },
    {
      "id": "kagoshima-15",
      "a": "赤間",
      "b": "教育大前",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-16",
      "a": "教育大前",
      "b": "海老津",
      "line": "kagoshima",
      "via": [
        [
          -5410,
          3456
        ],
        [
          -5387,
          3441
        ],
        [
          -5375,
          3414
        ],
        [
          -5376,
          3391
        ],
        [
          -5358,
          3348
        ],
        [
          -5326,
          3306
        ]
      ]
    },
    {
      "id": "kagoshima-17",
      "a": "海老津",
      "b": "遠賀川",
      "line": "kagoshima",
      "via": [
        [
          -5241,
          3274
        ],
        [
          -5221,
          3252
        ],
        [
          -5191,
          3238
        ],
        [
          -5177,
          3240
        ],
        [
          -5136,
          3264
        ]
      ]
    },
    {
      "id": "kagoshima-18",
      "a": "遠賀川",
      "b": "水巻",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-19",
      "a": "水巻",
      "b": "折尾",
      "line": "kagoshima",
      "via": [
        [
          -4938,
          3201
        ],
        [
          -4901,
          3170
        ],
        [
          -4891,
          3150
        ]
      ]
    },
    {
      "id": "kagoshima-20",
      "a": "折尾",
      "b": "陣原",
      "line": "kagoshima",
      "via": [
        [
          -4822,
          3147
        ],
        [
          -4778,
          3118
        ],
        [
          -4702,
          3130
        ]
      ]
    },
    {
      "id": "kagoshima-21",
      "a": "陣原",
      "b": "黒崎",
      "line": "kagoshima",
      "via": [
        [
          -4681,
          3133
        ]
      ]
    },
    {
      "id": "kagoshima-22",
      "a": "黒崎",
      "b": "八幡",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-23",
      "a": "八幡",
      "b": "スペースワールド",
      "line": "kagoshima",
      "via": [
        [
          -4470,
          3118
        ]
      ]
    },
    {
      "id": "kagoshima-24",
      "a": "スペースワールド",
      "b": "枝光",
      "line": "kagoshima"
    },
    {
      "id": "kagoshima-25",
      "a": "枝光",
      "b": "戸畑",
      "line": "kagoshima",
      "via": [
        [
          -4404,
          2983
        ]
      ]
    },
    {
      "id": "kagoshima-26",
      "a": "戸畑",
      "b": "九州工大前",
      "line": "kagoshima",
      "via": [
        [
          -4338,
          2938
        ]
      ]
    },
    {
      "id": "kagoshima-27",
      "a": "九州工大前",
      "b": "西小倉",
      "line": "kagoshima",
      "via": [
        [
          -4238,
          2954
        ],
        [
          -4166,
          3000
        ]
      ]
    },
    {
      "id": "kagoshima-28",
      "a": "西小倉",
      "b": "小倉",
      "line": "kagoshima"
    },
    {
      "id": "kashii-1",
      "a": "香椎",
      "b": "和白",
      "line": "kashii",
      "via": [
        [
          -6112,
          4250
        ],
        [
          -6119,
          4214
        ],
        [
          -6114,
          4208
        ],
        [
          -6113,
          4203
        ],
        [
          -6114,
          4197
        ],
        [
          -6114,
          4196
        ],
        [
          -6117,
          4192
        ],
        [
          -6118,
          4191
        ],
        [
          -6126,
          4187
        ],
        [
          -6127,
          4184
        ]
      ]
    },
    {
      "id": "kashii-2",
      "a": "和白",
      "b": "奈多",
      "line": "kashii",
      "via": [
        [
          -6192,
          4109
        ],
        [
          -6207,
          4108
        ]
      ]
    },
    {
      "id": "kashii-3",
      "a": "奈多",
      "b": "雁ノ巣",
      "line": "kashii"
    },
    {
      "id": "kashii-4",
      "a": "雁ノ巣",
      "b": "海ノ中道",
      "line": "kashii",
      "via": [
        [
          -6339,
          4156
        ],
        [
          -6413,
          4210
        ],
        [
          -6482,
          4243
        ]
      ]
    },
    {
      "id": "kashii-5",
      "a": "海ノ中道",
      "b": "西戸崎",
      "line": "kashii"
    },
    {
      "id": "kyushu-1",
      "a": "博多",
      "b": "新鳥栖",
      "line": "kyushu",
      "via": [
        [
          -6217,
          4719
        ],
        [
          -6163,
          4795
        ],
        [
          -6147,
          4842
        ],
        [
          -6166,
          4988
        ],
        [
          -6131,
          5140
        ],
        [
          -6098,
          5242
        ],
        [
          -6097,
          5290
        ],
        [
          -6112,
          5401
        ],
        [
          -6112,
          5483
        ],
        [
          -6103,
          5539
        ],
        [
          -6072,
          5614
        ],
        [
          -5946,
          5792
        ]
      ]
    },
    {
      "id": "kyushu-2",
      "a": "新鳥栖",
      "b": "久留米",
      "line": "kyushu",
      "via": [
        [
          -5875,
          5940
        ],
        [
          -5872,
          6099
        ]
      ]
    },
    {
      "id": "kyushu-3",
      "a": "久留米",
      "b": "筑後船小屋",
      "line": "kyushu",
      "via": [
        [
          -5840,
          6244
        ],
        [
          -5844,
          6481
        ],
        [
          -5855,
          6688
        ]
      ]
    },
    {
      "id": "kyushu-4",
      "a": "筑後船小屋",
      "b": "新大牟田",
      "line": "kyushu",
      "via": [
        [
          -5885,
          7142
        ],
        [
          -5922,
          7433
        ]
      ]
    },
    {
      "id": "kyushu-5",
      "a": "新大牟田",
      "b": "新玉名",
      "line": "kyushu",
      "via": [
        [
          -5888,
          7654
        ],
        [
          -5864,
          7718
        ],
        [
          -5682,
          8041
        ]
      ]
    },
    {
      "id": "kyushu-6",
      "a": "新玉名",
      "b": "熊本",
      "line": "kyushu",
      "via": [
        [
          -5371,
          8365
        ],
        [
          -5075,
          8665
        ],
        [
          -5050,
          8697
        ],
        [
          -4941,
          8929
        ],
        [
          -4962,
          9010
        ],
        [
          -4970,
          9073
        ]
      ]
    },
    {
      "id": "kyushu-7",
      "a": "熊本",
      "b": "新八代",
      "line": "kyushu",
      "via": [
        [
          -5005,
          9135
        ],
        [
          -5002,
          9166
        ],
        [
          -5039,
          9420
        ],
        [
          -5089,
          9689
        ],
        [
          -5118,
          9794
        ],
        [
          -5114,
          9862
        ],
        [
          -5082,
          9967
        ],
        [
          -5086,
          10044
        ],
        [
          -5107,
          10095
        ],
        [
          -5260,
          10358
        ],
        [
          -5281,
          10422
        ],
        [
          -5278,
          10500
        ]
      ]
    },
    {
      "id": "kyushu-8",
      "a": "新八代",
      "b": "新水俣",
      "line": "kyushu",
      "via": [
        [
          -5223,
          10685
        ],
        [
          -5229,
          10805
        ],
        [
          -5247,
          10854
        ],
        [
          -5307,
          10957
        ],
        [
          -5318,
          11001
        ],
        [
          -5317,
          11064
        ],
        [
          -5277,
          11214
        ],
        [
          -5266,
          11304
        ],
        [
          -5278,
          11384
        ],
        [
          -5306,
          11452
        ],
        [
          -5413,
          11586
        ],
        [
          -5797,
          12017
        ],
        [
          -5843,
          12050
        ],
        [
          -6033,
          12147
        ],
        [
          -6061,
          12173
        ],
        [
          -6132,
          12268
        ]
      ]
    },
    {
      "id": "kyushu-9",
      "a": "新水俣",
      "b": "出水",
      "line": "kyushu",
      "via": [
        [
          -6334,
          12465
        ],
        [
          -6441,
          12599
        ],
        [
          -6461,
          12633
        ],
        [
          -6533,
          12840
        ],
        [
          -6533,
          12909
        ]
      ]
    },
    {
      "id": "kyushu-10",
      "a": "出水",
      "b": "川内",
      "line": "kyushu",
      "via": [
        [
          -6477,
          13065
        ],
        [
          -6476,
          13095
        ],
        [
          -6485,
          13125
        ],
        [
          -6734,
          13548
        ],
        [
          -6752,
          13601
        ],
        [
          -6771,
          13736
        ],
        [
          -6819,
          14090
        ],
        [
          -6821,
          14180
        ],
        [
          -6800,
          14261
        ],
        [
          -6744,
          14397
        ]
      ]
    },
    {
      "id": "kyushu-11",
      "a": "川内",
      "b": "鹿児島中央",
      "line": "kyushu",
      "via": [
        [
          -6697,
          14601
        ],
        [
          -6642,
          14701
        ],
        [
          -6462,
          15185
        ],
        [
          -6422,
          15250
        ],
        [
          -6179,
          15519
        ],
        [
          -6133,
          15554
        ],
        [
          -5968,
          15669
        ],
        [
          -5848,
          15712
        ],
        [
          -5741,
          15779
        ]
      ]
    },
    {
      "id": "tohoku-1",
      "a": "東京",
      "b": "上野",
      "line": "tohoku"
    },
    {
      "id": "tohoku-2",
      "a": "上野",
      "b": "大宮",
      "line": "tohoku",
      "via": [
        [
          36766,
          -7142
        ],
        [
          36761,
          -7161
        ],
        [
          36734,
          -7176
        ],
        [
          36665,
          -7262
        ],
        [
          36591,
          -7312
        ],
        [
          36568,
          -7334
        ],
        [
          36550,
          -7362
        ],
        [
          36524,
          -7387
        ],
        [
          36473,
          -7498
        ],
        [
          36427,
          -7517
        ],
        [
          36398,
          -7537
        ],
        [
          36356,
          -7544
        ],
        [
          36341,
          -7554
        ],
        [
          36320,
          -7610
        ],
        [
          36269,
          -7662
        ],
        [
          36236,
          -7726
        ],
        [
          36194,
          -7761
        ],
        [
          36150,
          -7845
        ],
        [
          36102,
          -7897
        ],
        [
          36050,
          -8055
        ],
        [
          36052,
          -8072
        ],
        [
          36070,
          -8115
        ],
        [
          36064,
          -8140
        ]
      ]
    },
    {
      "id": "tohoku-3",
      "a": "大宮",
      "b": "小山",
      "line": "tohoku",
      "via": [
        [
          36016,
          -8271
        ],
        [
          36012,
          -8323
        ],
        [
          36058,
          -8605
        ],
        [
          36194,
          -8830
        ],
        [
          36298,
          -9076
        ],
        [
          36466,
          -9401
        ],
        [
          36577,
          -9707
        ],
        [
          36745,
          -10223
        ],
        [
          36768,
          -10265
        ],
        [
          36860,
          -10395
        ]
      ]
    },
    {
      "id": "tohoku-4",
      "a": "小山",
      "b": "宇都宮",
      "line": "tohoku",
      "via": [
        [
          37135,
          -10970
        ],
        [
          37206,
          -11421
        ],
        [
          37272,
          -11642
        ]
      ]
    },
    {
      "id": "tohoku-5",
      "a": "宇都宮",
      "b": "那須塩原",
      "line": "tohoku",
      "via": [
        [
          37340,
          -12019
        ],
        [
          37395,
          -12563
        ],
        [
          37468,
          -12798
        ],
        [
          37552,
          -13037
        ],
        [
          37613,
          -13428
        ],
        [
          37637,
          -13484
        ]
      ]
    },
    {
      "id": "tohoku-6",
      "a": "那須塩原",
      "b": "新白河",
      "line": "tohoku",
      "via": [
        [
          38005,
          -14027
        ],
        [
          38158,
          -14243
        ],
        [
          38366,
          -14581
        ]
      ]
    },
    {
      "id": "tohoku-7",
      "a": "新白河",
      "b": "郡山",
      "line": "tohoku",
      "via": [
        [
          39036,
          -15442
        ],
        [
          39430,
          -16075
        ],
        [
          39533,
          -16344
        ]
      ]
    },
    {
      "id": "tohoku-8",
      "a": "郡山",
      "b": "福島",
      "line": "tohoku",
      "via": [
        [
          39615,
          -16679
        ],
        [
          39750,
          -17097
        ],
        [
          39917,
          -17470
        ],
        [
          39926,
          -17505
        ],
        [
          39958,
          -17887
        ],
        [
          39946,
          -17947
        ],
        [
          39857,
          -18158
        ],
        [
          39856,
          -18206
        ],
        [
          39878,
          -18350
        ]
      ]
    },
    {
      "id": "tohoku-9",
      "a": "福島",
      "b": "白石蔵王",
      "line": "tohoku",
      "via": [
        [
          39882,
          -18499
        ],
        [
          39894,
          -18544
        ],
        [
          40066,
          -18870
        ],
        [
          40244,
          -19144
        ]
      ]
    },
    {
      "id": "tohoku-10",
      "a": "白石蔵王",
      "b": "仙台",
      "line": "tohoku",
      "via": [
        [
          40733,
          -19845
        ],
        [
          40760,
          -19872
        ],
        [
          41773,
          -20790
        ],
        [
          41800,
          -20837
        ],
        [
          41821,
          -20910
        ],
        [
          41828,
          -20999
        ],
        [
          41844,
          -21077
        ],
        [
          41879,
          -21123
        ],
        [
          41868,
          -21168
        ],
        [
          41825,
          -21214
        ]
      ]
    },
    {
      "id": "tohoku-11",
      "a": "仙台",
      "b": "古川",
      "line": "tohoku",
      "via": [
        [
          41836,
          -21269
        ],
        [
          41879,
          -21289
        ],
        [
          41960,
          -21304
        ],
        [
          42129,
          -21425
        ],
        [
          42156,
          -21454
        ],
        [
          42196,
          -21515
        ],
        [
          42217,
          -21566
        ],
        [
          42223,
          -21609
        ],
        [
          42221,
          -21668
        ],
        [
          42176,
          -22539
        ],
        [
          42188,
          -22818
        ]
      ]
    },
    {
      "id": "tohoku-12",
      "a": "古川",
      "b": "くりこま高原",
      "line": "tohoku",
      "via": [
        [
          42242,
          -23053
        ],
        [
          42399,
          -23324
        ]
      ]
    },
    {
      "id": "tohoku-13",
      "a": "くりこま高原",
      "b": "一ノ関",
      "line": "tohoku",
      "via": [
        [
          42785,
          -24152
        ],
        [
          42899,
          -24595
        ],
        [
          42954,
          -24769
        ],
        [
          42976,
          -24861
        ]
      ]
    },
    {
      "id": "tohoku-14",
      "a": "一ノ関",
      "b": "水沢江刺",
      "line": "tohoku",
      "via": [
        [
          43033,
          -25020
        ],
        [
          43086,
          -25220
        ],
        [
          43266,
          -25787
        ],
        [
          43268,
          -25860
        ],
        [
          43252,
          -26073
        ]
      ]
    },
    {
      "id": "tohoku-15",
      "a": "水沢江刺",
      "b": "北上",
      "line": "tohoku",
      "via": [
        [
          43197,
          -26270
        ],
        [
          43177,
          -26311
        ],
        [
          42919,
          -26635
        ],
        [
          42892,
          -26684
        ],
        [
          42881,
          -26729
        ],
        [
          42882,
          -26785
        ]
      ]
    },
    {
      "id": "tohoku-16",
      "a": "北上",
      "b": "新花巻",
      "line": "tohoku",
      "via": [
        [
          43013,
          -27076
        ]
      ]
    },
    {
      "id": "tohoku-17",
      "a": "新花巻",
      "b": "盛岡",
      "line": "tohoku",
      "via": [
        [
          43180,
          -27685
        ],
        [
          43157,
          -28235
        ],
        [
          43104,
          -28407
        ],
        [
          43034,
          -28826
        ],
        [
          43047,
          -29136
        ],
        [
          43036,
          -29173
        ]
      ]
    },
    {
      "id": "tohoku-18",
      "a": "盛岡",
      "b": "いわて沼宮内",
      "line": "tohoku",
      "via": [
        [
          42912,
          -29326
        ],
        [
          42906,
          -29360
        ],
        [
          43027,
          -29635
        ],
        [
          43067,
          -29761
        ],
        [
          43183,
          -29929
        ],
        [
          43219,
          -30008
        ],
        [
          43368,
          -30456
        ],
        [
          43374,
          -30528
        ]
      ]
    },
    {
      "id": "tohoku-19",
      "a": "いわて沼宮内",
      "b": "二戸",
      "line": "tohoku",
      "via": [
        [
          43372,
          -30755
        ],
        [
          43386,
          -30799
        ],
        [
          43407,
          -30833
        ],
        [
          43489,
          -30926
        ],
        [
          43507,
          -30960
        ],
        [
          43520,
          -31008
        ],
        [
          43634,
          -31652
        ],
        [
          43634,
          -31719
        ],
        [
          43592,
          -32062
        ],
        [
          43594,
          -32127
        ],
        [
          43617,
          -32216
        ]
      ]
    },
    {
      "id": "tohoku-20",
      "a": "二戸",
      "b": "八戸",
      "line": "tohoku",
      "via": [
        [
          43697,
          -32384
        ],
        [
          43703,
          -32419
        ],
        [
          43694,
          -32545
        ],
        [
          43698,
          -32587
        ],
        [
          43710,
          -32622
        ],
        [
          44177,
          -33375
        ],
        [
          44206,
          -33438
        ],
        [
          44260,
          -33599
        ],
        [
          44292,
          -33655
        ]
      ]
    },
    {
      "id": "tohoku-21",
      "a": "八戸",
      "b": "七戸十和田",
      "line": "tohoku",
      "via": [
        [
          44399,
          -33795
        ],
        [
          44414,
          -33839
        ],
        [
          44417,
          -33881
        ],
        [
          44412,
          -33920
        ],
        [
          44395,
          -33963
        ],
        [
          44357,
          -34022
        ],
        [
          44328,
          -34054
        ],
        [
          44212,
          -34135
        ],
        [
          43911,
          -34363
        ],
        [
          43576,
          -34640
        ],
        [
          43246,
          -34814
        ]
      ]
    },
    {
      "id": "tohoku-22",
      "a": "七戸十和田",
      "b": "新青森",
      "line": "tohoku",
      "via": [
        [
          42970,
          -34936
        ],
        [
          42806,
          -35059
        ],
        [
          42701,
          -35104
        ],
        [
          41847,
          -35258
        ],
        [
          41754,
          -35261
        ],
        [
          41672,
          -35249
        ],
        [
          41366,
          -35133
        ],
        [
          41311,
          -35129
        ],
        [
          41250,
          -35139
        ],
        [
          41081,
          -35197
        ],
        [
          41041,
          -35222
        ],
        [
          41006,
          -35256
        ],
        [
          40971,
          -35306
        ],
        [
          40954,
          -35354
        ],
        [
          40951,
          -35389
        ]
      ]
    },
    {
      "id": "hokkaido-1",
      "a": "新青森",
      "b": "奥津軽いまべつ",
      "line": "hokkaido",
      "via": [
        [
          40955,
          -35536
        ],
        [
          40946,
          -35566
        ],
        [
          40882,
          -35654
        ],
        [
          40696,
          -36068
        ],
        [
          40680,
          -36123
        ],
        [
          40659,
          -36249
        ],
        [
          40639,
          -36308
        ],
        [
          40395,
          -36725
        ],
        [
          40190,
          -37172
        ]
      ]
    },
    {
      "id": "hokkaido-2",
      "a": "奥津軽いまべつ",
      "b": "木古内",
      "line": "hokkaido",
      "via": [
        [
          40089,
          -37311
        ],
        [
          40029,
          -37363
        ],
        [
          39957,
          -37400
        ],
        [
          39798,
          -37451
        ],
        [
          39739,
          -37477
        ],
        [
          39492,
          -37651
        ],
        [
          39432,
          -37713
        ],
        [
          39396,
          -37773
        ],
        [
          39376,
          -37834
        ],
        [
          39370,
          -37885
        ],
        [
          39372,
          -38030
        ],
        [
          39348,
          -38126
        ],
        [
          39324,
          -38171
        ],
        [
          39161,
          -38397
        ],
        [
          38897,
          -38851
        ],
        [
          38855,
          -38932
        ],
        [
          38838,
          -39005
        ],
        [
          38841,
          -39085
        ],
        [
          38869,
          -39171
        ],
        [
          39195,
          -39667
        ],
        [
          39266,
          -39740
        ],
        [
          39516,
          -39934
        ]
      ]
    },
    {
      "id": "hokkaido-3",
      "a": "木古内",
      "b": "新函館北斗",
      "line": "hokkaido",
      "via": [
        [
          39980,
          -40435
        ],
        [
          40084,
          -40556
        ],
        [
          40151,
          -40605
        ],
        [
          40302,
          -40671
        ],
        [
          40372,
          -40717
        ],
        [
          40432,
          -40782
        ],
        [
          40525,
          -40933
        ],
        [
          40567,
          -40984
        ],
        [
          40610,
          -41021
        ],
        [
          40847,
          -41187
        ],
        [
          40878,
          -41217
        ],
        [
          40898,
          -41251
        ],
        [
          40908,
          -41292
        ],
        [
          40906,
          -41331
        ],
        [
          40893,
          -41368
        ],
        [
          40871,
          -41399
        ],
        [
          40840,
          -41425
        ]
      ]
    },
    {
      "id": "seto-12",
      "a": "児島",
      "b": "坂出",
      "line": "seto",
      "via": [
        [
          9330,
          -135
        ],
        [
          9337,
          -60
        ],
        [
          9317,
          65
        ],
        [
          9347,
          189
        ],
        [
          9380,
          244
        ],
        [
          9430,
          432
        ],
        [
          9419,
          519
        ],
        [
          9423,
          565
        ],
        [
          9400,
          633
        ],
        [
          9412,
          649
        ],
        [
          9466,
          675
        ],
        [
          9516,
          657
        ]
      ]
    },
    {
      "id": "yosan-1",
      "a": "坂出",
      "b": "八十場",
      "line": "yosan",
      "via": [
        [
          9645,
          645
        ]
      ]
    },
    {
      "id": "yosan-2",
      "a": "八十場",
      "b": "鴨川",
      "line": "yosan",
      "via": [
        [
          9764,
          674
        ]
      ]
    },
    {
      "id": "yosan-3",
      "a": "鴨川",
      "b": "讃岐府中",
      "line": "yosan",
      "via": [
        [
          9855,
          768
        ]
      ]
    },
    {
      "id": "yosan-4",
      "a": "讃岐府中",
      "b": "国分",
      "line": "yosan",
      "via": [
        [
          9923,
          761
        ],
        [
          9937,
          732
        ]
      ]
    },
    {
      "id": "yosan-5",
      "a": "国分",
      "b": "端岡",
      "line": "yosan",
      "via": [
        [
          10029,
          713
        ]
      ]
    },
    {
      "id": "yosan-6",
      "a": "端岡",
      "b": "鬼無",
      "line": "yosan",
      "via": [
        [
          10138,
          662
        ]
      ]
    },
    {
      "id": "yosan-7",
      "a": "鬼無",
      "b": "香西",
      "line": "yosan",
      "via": [
        [
          10213,
          550
        ],
        [
          10248,
          527
        ]
      ]
    },
    {
      "id": "yosan-8",
      "a": "香西",
      "b": "高松",
      "line": "yosan",
      "via": [
        [
          10273,
          477
        ],
        [
          10283,
          471
        ],
        [
          10349,
          474
        ]
      ]
    },
    {
      "id": "hokuriku-1",
      "a": "大宮",
      "b": "熊谷",
      "line": "hokuriku",
      "via": [
        [
          36017,
          -8269
        ],
        [
          36012,
          -8311
        ],
        [
          36048,
          -8566
        ],
        [
          36049,
          -8605
        ],
        [
          36036,
          -8662
        ],
        [
          36002,
          -8717
        ],
        [
          35549,
          -9143
        ],
        [
          35249,
          -9350
        ]
      ]
    },
    {
      "id": "hokuriku-2",
      "a": "熊谷",
      "b": "本庄早稲田",
      "line": "hokuriku",
      "via": [
        [
          34824,
          -9539
        ],
        [
          34646,
          -9559
        ],
        [
          34583,
          -9577
        ]
      ]
    },
    {
      "id": "hokuriku-3",
      "a": "本庄早稲田",
      "b": "高崎",
      "line": "hokuriku",
      "via": [
        [
          33808,
          -10032
        ],
        [
          33529,
          -10219
        ],
        [
          33315,
          -10328
        ],
        [
          33283,
          -10358
        ],
        [
          33258,
          -10397
        ],
        [
          33247,
          -10434
        ]
      ]
    },
    {
      "id": "hokuriku-4",
      "a": "高崎",
      "b": "安中榛名",
      "line": "hokuriku",
      "via": [
        [
          33225,
          -10596
        ],
        [
          33165,
          -10691
        ],
        [
          33134,
          -10720
        ],
        [
          33050,
          -10779
        ],
        [
          32993,
          -10803
        ],
        [
          32945,
          -10810
        ],
        [
          32904,
          -10807
        ],
        [
          32670,
          -10747
        ]
      ]
    },
    {
      "id": "hokuriku-5",
      "a": "安中榛名",
      "b": "軽井沢",
      "line": "hokuriku",
      "via": [
        [
          32439,
          -10719
        ],
        [
          32393,
          -10738
        ],
        [
          32366,
          -10759
        ],
        [
          32294,
          -10839
        ],
        [
          32229,
          -10875
        ],
        [
          32179,
          -10886
        ],
        [
          31890,
          -10911
        ],
        [
          31823,
          -10892
        ],
        [
          31697,
          -10825
        ],
        [
          31663,
          -10787
        ],
        [
          31578,
          -10625
        ],
        [
          31549,
          -10605
        ]
      ]
    },
    {
      "id": "hokuriku-6",
      "a": "軽井沢",
      "b": "佐久平",
      "line": "hokuriku",
      "via": [
        [
          31365,
          -10607
        ],
        [
          31222,
          -10581
        ],
        [
          31179,
          -10565
        ],
        [
          31138,
          -10539
        ],
        [
          31049,
          -10456
        ],
        [
          30921,
          -10388
        ],
        [
          30791,
          -10285
        ]
      ]
    },
    {
      "id": "hokuriku-7",
      "a": "佐久平",
      "b": "上田",
      "line": "hokuriku",
      "via": [
        [
          30668,
          -10220
        ],
        [
          30616,
          -10210
        ],
        [
          30561,
          -10217
        ],
        [
          30506,
          -10242
        ],
        [
          30182,
          -10480
        ],
        [
          29881,
          -10685
        ],
        [
          29846,
          -10729
        ],
        [
          29804,
          -10824
        ]
      ]
    },
    {
      "id": "hokuriku-8",
      "a": "上田",
      "b": "長野",
      "line": "hokuriku",
      "via": [
        [
          29711,
          -10928
        ],
        [
          29638,
          -10975
        ],
        [
          29602,
          -11014
        ],
        [
          29566,
          -11098
        ],
        [
          29544,
          -11227
        ],
        [
          29520,
          -11284
        ],
        [
          29234,
          -11593
        ],
        [
          29205,
          -11638
        ],
        [
          29190,
          -11687
        ],
        [
          29193,
          -11812
        ],
        [
          29271,
          -12053
        ],
        [
          29294,
          -12162
        ],
        [
          29313,
          -12186
        ],
        [
          29383,
          -12234
        ],
        [
          29425,
          -12249
        ]
      ]
    },
    {
      "id": "hokuriku-9",
      "a": "長野",
      "b": "飯山",
      "line": "hokuriku",
      "via": [
        [
          29528,
          -12332
        ],
        [
          29723,
          -12480
        ],
        [
          29832,
          -12593
        ],
        [
          29970,
          -12698
        ],
        [
          30062,
          -12750
        ],
        [
          30107,
          -12796
        ],
        [
          30135,
          -12851
        ],
        [
          30151,
          -12956
        ],
        [
          30165,
          -12995
        ],
        [
          30195,
          -13041
        ],
        [
          30270,
          -13119
        ],
        [
          30290,
          -13156
        ],
        [
          30302,
          -13195
        ],
        [
          30305,
          -13246
        ],
        [
          30294,
          -13296
        ]
      ]
    },
    {
      "id": "hokuriku-10",
      "a": "飯山",
      "b": "上越妙高",
      "line": "hokuriku",
      "via": [
        [
          29991,
          -13745
        ],
        [
          29963,
          -13808
        ],
        [
          29955,
          -13853
        ],
        [
          29948,
          -14050
        ],
        [
          29981,
          -14322
        ],
        [
          29980,
          -14363
        ],
        [
          29967,
          -14410
        ],
        [
          29881,
          -14552
        ],
        [
          29788,
          -14634
        ]
      ]
    },
    {
      "id": "hokuriku-11",
      "a": "上越妙高",
      "b": "糸魚川",
      "line": "hokuriku",
      "via": [
        [
          29667,
          -14767
        ],
        [
          29573,
          -14839
        ],
        [
          29498,
          -14866
        ],
        [
          29425,
          -14869
        ],
        [
          28850,
          -14756
        ],
        [
          28515,
          -14714
        ],
        [
          28416,
          -14693
        ],
        [
          28381,
          -14683
        ],
        [
          28341,
          -14661
        ],
        [
          28236,
          -14576
        ],
        [
          28203,
          -14558
        ],
        [
          28162,
          -14544
        ],
        [
          28056,
          -14526
        ]
      ]
    },
    {
      "id": "hokuriku-12",
      "a": "糸魚川",
      "b": "黒部宇奈月温泉",
      "line": "hokuriku",
      "via": [
        [
          27852,
          -14451
        ],
        [
          27681,
          -14362
        ],
        [
          27537,
          -14325
        ],
        [
          27375,
          -14252
        ],
        [
          26961,
          -14096
        ],
        [
          26363,
          -13735
        ],
        [
          26322,
          -13696
        ]
      ]
    },
    {
      "id": "hokuriku-13",
      "a": "黒部宇奈月温泉",
      "b": "富山",
      "line": "hokuriku",
      "via": [
        [
          26157,
          -13498
        ],
        [
          26087,
          -13400
        ],
        [
          25955,
          -13116
        ],
        [
          25918,
          -13061
        ],
        [
          25879,
          -13029
        ],
        [
          25700,
          -12910
        ],
        [
          25457,
          -12695
        ],
        [
          25393,
          -12661
        ],
        [
          25324,
          -12651
        ],
        [
          25277,
          -12658
        ],
        [
          25177,
          -12688
        ],
        [
          25148,
          -12687
        ],
        [
          25107,
          -12665
        ],
        [
          25075,
          -12602
        ],
        [
          25058,
          -12586
        ],
        [
          25015,
          -12576
        ]
      ]
    },
    {
      "id": "hokuriku-14",
      "a": "富山",
      "b": "新高岡",
      "line": "hokuriku",
      "via": [
        [
          24907,
          -12627
        ],
        [
          24857,
          -12670
        ],
        [
          24771,
          -12700
        ],
        [
          24449,
          -12744
        ],
        [
          24391,
          -12739
        ],
        [
          24307,
          -12709
        ],
        [
          24253,
          -12700
        ],
        [
          24202,
          -12705
        ],
        [
          24123,
          -12727
        ]
      ]
    },
    {
      "id": "hokuriku-15",
      "a": "新高岡",
      "b": "金沢",
      "line": "hokuriku",
      "via": [
        [
          23969,
          -12727
        ],
        [
          23826,
          -12665
        ],
        [
          23661,
          -12551
        ],
        [
          23544,
          -12453
        ],
        [
          23473,
          -12419
        ],
        [
          23428,
          -12413
        ],
        [
          23382,
          -12417
        ],
        [
          23193,
          -12475
        ],
        [
          23056,
          -12496
        ],
        [
          22996,
          -12491
        ],
        [
          22945,
          -12471
        ],
        [
          22890,
          -12426
        ],
        [
          22831,
          -12340
        ],
        [
          22749,
          -12255
        ],
        [
          22615,
          -12148
        ],
        [
          22512,
          -12033
        ],
        [
          22478,
          -11981
        ],
        [
          22396,
          -11933
        ]
      ]
    },
    {
      "id": "hokuriku-16",
      "a": "金沢",
      "b": "小松",
      "line": "hokuriku",
      "via": [
        [
          22331,
          -11833
        ],
        [
          22262,
          -11775
        ],
        [
          22037,
          -11641
        ],
        [
          21956,
          -11601
        ],
        [
          21794,
          -11465
        ],
        [
          21687,
          -11322
        ],
        [
          21612,
          -11174
        ],
        [
          21538,
          -11101
        ],
        [
          21511,
          -11065
        ],
        [
          21490,
          -11013
        ]
      ]
    },
    {
      "id": "hokuriku-17",
      "a": "小松",
      "b": "加賀温泉",
      "line": "hokuriku",
      "via": [
        [
          21478,
          -10873
        ],
        [
          21468,
          -10833
        ],
        [
          21420,
          -10737
        ],
        [
          21389,
          -10654
        ],
        [
          21353,
          -10604
        ],
        [
          21267,
          -10537
        ],
        [
          21219,
          -10512
        ],
        [
          21172,
          -10501
        ],
        [
          21072,
          -10497
        ]
      ]
    },
    {
      "id": "hokuriku-18",
      "a": "加賀温泉",
      "b": "芦原温泉",
      "line": "hokuriku",
      "via": [
        [
          20952,
          -10458
        ],
        [
          20916,
          -10436
        ],
        [
          20809,
          -10303
        ],
        [
          20579,
          -10133
        ],
        [
          20548,
          -10091
        ],
        [
          20497,
          -9988
        ],
        [
          20486,
          -9946
        ]
      ]
    },
    {
      "id": "hokuriku-19",
      "a": "芦原温泉",
      "b": "福井",
      "line": "hokuriku",
      "via": [
        [
          20487,
          -9847
        ],
        [
          20559,
          -9585
        ],
        [
          20565,
          -9526
        ],
        [
          20559,
          -9490
        ],
        [
          20524,
          -9378
        ],
        [
          20530,
          -9256
        ],
        [
          20525,
          -9220
        ],
        [
          20480,
          -9137
        ],
        [
          20470,
          -9089
        ]
      ]
    },
    {
      "id": "hokuriku-20",
      "a": "福井",
      "b": "越前たけふ",
      "line": "hokuriku",
      "via": [
        [
          20402,
          -8995
        ],
        [
          20407,
          -8884
        ],
        [
          20427,
          -8811
        ],
        [
          20432,
          -8766
        ],
        [
          20429,
          -8728
        ],
        [
          20392,
          -8572
        ],
        [
          20402,
          -8391
        ],
        [
          20390,
          -8341
        ],
        [
          20343,
          -8244
        ]
      ]
    },
    {
      "id": "hokuriku-21",
      "a": "越前たけふ",
      "b": "敦賀",
      "line": "hokuriku",
      "via": [
        [
          20277,
          -7966
        ],
        [
          20179,
          -7791
        ],
        [
          19911,
          -6959
        ],
        [
          19846,
          -6815
        ]
      ]
    },
    {
      "id": "hokurikuhon-1",
      "a": "敦賀",
      "b": "新疋田",
      "line": "hokurikuhon",
      "via": [
        [
          19745,
          -6723
        ],
        [
          19738,
          -6698
        ],
        [
          19754,
          -6628
        ],
        [
          19770,
          -6607
        ],
        [
          19788,
          -6544
        ],
        [
          19814,
          -6513
        ],
        [
          19852,
          -6492
        ]
      ]
    },
    {
      "id": "hokurikuhon-2",
      "a": "新疋田",
      "b": "近江塩津",
      "line": "hokurikuhon",
      "via": [
        [
          20044,
          -6239
        ],
        [
          20078,
          -6212
        ]
      ]
    },
    {
      "id": "kosei-1",
      "a": "近江塩津",
      "b": "永原",
      "line": "kosei",
      "via": [
        [
          20112,
          -6099
        ],
        [
          20110,
          -6056
        ],
        [
          20102,
          -6030
        ]
      ]
    },
    {
      "id": "kosei-2",
      "a": "永原",
      "b": "マキノ",
      "line": "kosei",
      "via": [
        [
          19886,
          -5860
        ],
        [
          19768,
          -5799
        ],
        [
          19725,
          -5744
        ]
      ]
    },
    {
      "id": "kosei-3",
      "a": "マキノ",
      "b": "近江中庄",
      "line": "kosei",
      "via": [
        [
          19599,
          -5666
        ],
        [
          19584,
          -5639
        ]
      ]
    },
    {
      "id": "kosei-4",
      "a": "近江中庄",
      "b": "近江今津",
      "line": "kosei",
      "via": [
        [
          19562,
          -5405
        ]
      ]
    },
    {
      "id": "kosei-5",
      "a": "近江今津",
      "b": "新旭",
      "line": "kosei",
      "via": [
        [
          19542,
          -5322
        ],
        [
          19560,
          -5256
        ],
        [
          19569,
          -5159
        ]
      ]
    },
    {
      "id": "kosei-6",
      "a": "新旭",
      "b": "安曇川",
      "line": "kosei",
      "via": [
        [
          19557,
          -5102
        ],
        [
          19504,
          -5012
        ]
      ]
    },
    {
      "id": "kosei-7",
      "a": "安曇川",
      "b": "近江高島",
      "line": "kosei",
      "via": [
        [
          19465,
          -4861
        ],
        [
          19443,
          -4812
        ]
      ]
    },
    {
      "id": "kosei-8",
      "a": "近江高島",
      "b": "北小松",
      "line": "kosei",
      "via": [
        [
          19465,
          -4734
        ],
        [
          19462,
          -4709
        ],
        [
          19451,
          -4691
        ],
        [
          19420,
          -4669
        ],
        [
          19372,
          -4652
        ],
        [
          19317,
          -4603
        ],
        [
          19284,
          -4583
        ]
      ]
    },
    {
      "id": "kosei-9",
      "a": "北小松",
      "b": "近江舞子",
      "line": "kosei",
      "via": [
        [
          19238,
          -4525
        ]
      ]
    },
    {
      "id": "kosei-10",
      "a": "近江舞子",
      "b": "比良",
      "line": "kosei",
      "via": [
        [
          19189,
          -4423
        ]
      ]
    },
    {
      "id": "kosei-11",
      "a": "比良",
      "b": "志賀",
      "line": "kosei",
      "via": [
        [
          19101,
          -4317
        ]
      ]
    },
    {
      "id": "kosei-12",
      "a": "志賀",
      "b": "蓬莱",
      "line": "kosei",
      "via": [
        [
          19023,
          -4210
        ]
      ]
    },
    {
      "id": "kosei-13",
      "a": "蓬莱",
      "b": "和邇",
      "line": "kosei",
      "via": [
        [
          19012,
          -4114
        ]
      ]
    },
    {
      "id": "kosei-14",
      "a": "和邇",
      "b": "小野",
      "line": "kosei",
      "via": [
        [
          19057,
          -4011
        ]
      ]
    },
    {
      "id": "kosei-15",
      "a": "小野",
      "b": "堅田",
      "line": "kosei",
      "via": [
        [
          19035,
          -3867
        ]
      ]
    },
    {
      "id": "kosei-16",
      "a": "堅田",
      "b": "おごと温泉",
      "line": "kosei",
      "via": [
        [
          18966,
          -3753
        ]
      ]
    },
    {
      "id": "kosei-17",
      "a": "おごと温泉",
      "b": "比叡山坂本",
      "line": "kosei",
      "via": [
        [
          18879,
          -3636
        ]
      ]
    },
    {
      "id": "kosei-18",
      "a": "比叡山坂本",
      "b": "唐崎",
      "line": "kosei",
      "via": [
        [
          18820,
          -3464
        ]
      ]
    },
    {
      "id": "kosei-19",
      "a": "唐崎",
      "b": "大津京",
      "line": "kosei",
      "via": [
        [
          18768,
          -3399
        ],
        [
          18767,
          -3326
        ]
      ]
    },
    {
      "id": "kosei-20",
      "a": "大津京",
      "b": "山科",
      "line": "kosei",
      "via": [
        [
          18718,
          -3261
        ],
        [
          18659,
          -3159
        ],
        [
          18609,
          -3120
        ]
      ]
    },
    {
      "id": "kyoto-1",
      "a": "山科",
      "b": "京都",
      "line": "kyoto",
      "via": [
        [
          18507,
          -3112
        ],
        [
          18478,
          -3095
        ],
        [
          18379,
          -3079
        ]
      ]
    },
    {
      "id": "kyoto-2",
      "a": "京都",
      "b": "西大路",
      "line": "kyoto",
      "via": [
        [
          18228,
          -3073
        ]
      ]
    },
    {
      "id": "kyoto-3",
      "a": "西大路",
      "b": "桂川",
      "line": "kyoto",
      "via": [
        [
          18093,
          -3000
        ]
      ]
    },
    {
      "id": "kyoto-4",
      "a": "桂川",
      "b": "向日町",
      "line": "kyoto"
    },
    {
      "id": "kyoto-5",
      "a": "向日町",
      "b": "長岡京",
      "line": "kyoto",
      "via": [
        [
          18065,
          -2829
        ]
      ]
    },
    {
      "id": "kyoto-6",
      "a": "長岡京",
      "b": "山崎",
      "line": "kyoto",
      "via": [
        [
          18004,
          -2673
        ],
        [
          17963,
          -2620
        ],
        [
          17949,
          -2573
        ]
      ]
    },
    {
      "id": "kyoto-7",
      "a": "山崎",
      "b": "島本",
      "line": "kyoto",
      "via": [
        [
          17892,
          -2544
        ]
      ]
    },
    {
      "id": "kyoto-8",
      "a": "島本",
      "b": "高槻",
      "line": "kyoto",
      "via": [
        [
          17823,
          -2429
        ],
        [
          17808,
          -2412
        ]
      ]
    },
    {
      "id": "kyoto-9",
      "a": "高槻",
      "b": "摂津富田",
      "line": "kyoto"
    },
    {
      "id": "kyoto-10",
      "a": "摂津富田",
      "b": "JR総持寺",
      "line": "kyoto"
    },
    {
      "id": "kyoto-11",
      "a": "JR総持寺",
      "b": "茨木",
      "line": "kyoto",
      "via": [
        [
          17422,
          -2174
        ]
      ]
    },
    {
      "id": "kyoto-12",
      "a": "茨木",
      "b": "千里丘",
      "line": "kyoto"
    },
    {
      "id": "kyoto-13",
      "a": "千里丘",
      "b": "岸辺",
      "line": "kyoto",
      "via": [
        [
          17319,
          -1945
        ]
      ]
    },
    {
      "id": "kyoto-14",
      "a": "岸辺",
      "b": "吹田",
      "line": "kyoto"
    },
    {
      "id": "kyoto-15",
      "a": "吹田",
      "b": "東淀川",
      "line": "kyoto",
      "via": [
        [
          17149,
          -1771
        ]
      ]
    },
    {
      "id": "kyoto-16",
      "a": "東淀川",
      "b": "新大阪",
      "line": "kyoto",
      "via": [
        [
          17112,
          -1662
        ]
      ]
    },
    {
      "id": "kyoto-17",
      "a": "新大阪",
      "b": "大阪",
      "line": "kyoto",
      "via": [
        [
          17121,
          -1630
        ],
        [
          17122,
          -1583
        ],
        [
          17112,
          -1523
        ]
      ]
    },
    {
      "id": "kanjo-1",
      "a": "大阪",
      "b": "福島（大阪）",
      "line": "kanjo"
    },
    {
      "id": "kanjo-2",
      "a": "福島（大阪）",
      "b": "野田",
      "line": "kanjo"
    },
    {
      "id": "kanjo-3",
      "a": "野田",
      "b": "西九条",
      "line": "kanjo"
    },
    {
      "id": "kanjo-4",
      "a": "西九条",
      "b": "弁天町",
      "line": "kanjo",
      "via": [
        [
          16926,
          -1354
        ]
      ]
    },
    {
      "id": "kanjo-5",
      "a": "弁天町",
      "b": "大正",
      "line": "kanjo",
      "via": [
        [
          16947,
          -1302
        ],
        [
          16979,
          -1313
        ]
      ]
    },
    {
      "id": "kanjo-6",
      "a": "大正",
      "b": "芦原橋",
      "line": "kanjo",
      "via": [
        [
          17039,
          -1288
        ]
      ]
    },
    {
      "id": "kanjo-7",
      "a": "芦原橋",
      "b": "今宮",
      "line": "kanjo"
    },
    {
      "id": "kanjo-8",
      "a": "今宮",
      "b": "新今宮",
      "line": "kanjo",
      "via": [
        [
          17083,
          -1223
        ]
      ]
    },
    {
      "id": "kanjo-9",
      "a": "新今宮",
      "b": "天王寺",
      "line": "kanjo"
    },
    {
      "id": "kanjo-10",
      "a": "天王寺",
      "b": "寺田町",
      "line": "kanjo",
      "via": [
        [
          17198,
          -1191
        ]
      ]
    },
    {
      "id": "kanjo-11",
      "a": "寺田町",
      "b": "桃谷",
      "line": "kanjo"
    },
    {
      "id": "kanjo-12",
      "a": "桃谷",
      "b": "鶴橋",
      "line": "kanjo"
    },
    {
      "id": "kanjo-13",
      "a": "鶴橋",
      "b": "玉造",
      "line": "kanjo"
    },
    {
      "id": "kanjo-14",
      "a": "玉造",
      "b": "森ノ宮",
      "line": "kanjo"
    },
    {
      "id": "kanjo-15",
      "a": "森ノ宮",
      "b": "大阪城公園",
      "line": "kanjo"
    },
    {
      "id": "kanjo-16",
      "a": "大阪城公園",
      "b": "京橋",
      "line": "kanjo",
      "via": [
        [
          17269,
          -1454
        ]
      ]
    },
    {
      "id": "kanjo-17",
      "a": "京橋",
      "b": "桜ノ宮",
      "line": "kanjo",
      "via": [
        [
          17252,
          -1493
        ],
        [
          17217,
          -1518
        ]
      ]
    },
    {
      "id": "kanjo-18",
      "a": "桜ノ宮",
      "b": "天満",
      "line": "kanjo",
      "via": [
        [
          17179,
          -1512
        ]
      ]
    },
    {
      "id": "kanjo-19",
      "a": "天満",
      "b": "大阪",
      "line": "kanjo",
      "via": [
        [
          17133,
          -1528
        ]
      ]
    },
    {
      "id": "yumesaki-1",
      "a": "西九条",
      "b": "安治川口",
      "line": "yumesaki",
      "via": [
        [
          16932,
          -1377
        ],
        [
          16903,
          -1381
        ],
        [
          16863,
          -1359
        ]
      ]
    },
    {
      "id": "yumesaki-2",
      "a": "安治川口",
      "b": "ユニバーサルシティ",
      "line": "yumesaki"
    },
    {
      "id": "yumesaki-3",
      "a": "ユニバーサルシティ",
      "b": "桜島",
      "line": "yumesaki",
      "via": [
        [
          16809,
          -1289
        ]
      ]
    }
  ],
  "lines": [
    {
      "id": "sanyo",
      "name": "山陽本線",
      "reading": "さんようほんせん",
      "color": "#247ab5",
      "stations": [
        "新山口",
        "四辻",
        "大道",
        "防府",
        "富海",
        "戸田",
        "福川",
        "新南陽",
        "徳山",
        "櫛ケ浜",
        "下松",
        "光",
        "島田",
        "岩田",
        "田布施",
        "柳井",
        "柳井港",
        "大畠",
        "神代",
        "由宇",
        "通津",
        "藤生",
        "南岩国",
        "岩国",
        "和木",
        "大竹",
        "玖波",
        "大野浦",
        "前空",
        "宮島口",
        "阿品",
        "宮内串戸",
        "廿日市",
        "五日市",
        "新井口",
        "西広島",
        "横川",
        "新白島",
        "広島",
        "天神川",
        "向洋",
        "海田市",
        "安芸中野",
        "中野東",
        "瀬野",
        "八本松",
        "寺家",
        "西条",
        "西高屋",
        "白市",
        "入野",
        "河内",
        "本郷",
        "三原",
        "糸崎",
        "尾道",
        "東尾道",
        "松永",
        "備後赤坂",
        "福山",
        "東福山",
        "大門",
        "笠岡",
        "里庄",
        "鴨方",
        "金光",
        "新倉敷",
        "西阿知",
        "倉敷",
        "中庄",
        "庭瀬",
        "北長瀬",
        "岡山"
      ]
    },
    {
      "id": "seto",
      "name": "瀬戸大橋線",
      "reading": "せとおおはしせん",
      "color": "#3b97dc",
      "stations": [
        "岡山",
        "大元",
        "備前西市",
        "妹尾",
        "備中箕島",
        "早島",
        "久々原",
        "茶屋町",
        "植松",
        "木見",
        "上の町",
        "児島",
        "坂出"
      ]
    },
    {
      "id": "kabe",
      "name": "可部線",
      "reading": "かべせん",
      "color": "#168770",
      "stations": [
        "横川",
        "三滝",
        "安芸長束",
        "下祇園",
        "古市橋",
        "大町",
        "緑井",
        "七軒茶屋",
        "梅林",
        "上八木",
        "中島",
        "可部",
        "河戸帆待川",
        "あき亀山"
      ]
    },
    {
      "id": "kure",
      "name": "呉線",
      "reading": "くれせん",
      "color": "#da8b27",
      "stations": [
        "海田市",
        "矢野",
        "坂",
        "水尻",
        "小屋浦",
        "呉ポートピア",
        "天応",
        "かるが浜",
        "吉浦",
        "川原石",
        "呉",
        "安芸阿賀",
        "新広",
        "広",
        "仁方",
        "安芸川尻",
        "安登",
        "安浦",
        "風早",
        "安芸津",
        "吉名",
        "竹原",
        "大乗",
        "安芸長浜",
        "忠海",
        "安芸幸崎",
        "須波",
        "三原"
      ]
    },
    {
      "id": "geibi",
      "name": "芸備線",
      "reading": "げいびせん",
      "color": "#a35c9b",
      "stations": [
        "広島",
        "矢賀",
        "戸坂",
        "安芸矢口",
        "玖村",
        "下深川"
      ]
    },
    {
      "id": "gantoku",
      "name": "岩徳線",
      "reading": "がんとくせん",
      "color": "#a46639",
      "stations": [
        "岩国",
        "西岩国",
        "川西",
        "柱野",
        "欽明路",
        "玖珂",
        "周防高森",
        "米川",
        "高水",
        "勝間",
        "大河内",
        "周防久保",
        "生野屋",
        "周防花岡",
        "櫛ケ浜"
      ]
    },
    {
      "id": "seiryu",
      "name": "錦川清流線",
      "reading": "にしきがわせいりゅうせん",
      "color": "#2f9fc4",
      "stations": [
        "川西",
        "清流新岩国",
        "守内かさ神",
        "南河内",
        "行波",
        "北河内",
        "椋野",
        "南桑",
        "根笠",
        "河山",
        "柳瀬",
        "錦町"
      ]
    },
    {
      "id": "shinkansen",
      "name": "山陽新幹線",
      "reading": "さんようしんかんせん",
      "color": "#093190",
      "track": "しんかんせん",
      "casing": "#8e999f",
      "fill": "#ffffff",
      "nozomi": ["博多", "小倉", "広島", "岡山", "新神戸", "新大阪"],
      "stations": [
        "博多",
        "小倉",
        "新下関",
        "厚狭",
        "新山口",
        "徳山",
        "新岩国",
        "広島",
        "東広島",
        "三原",
        "新尾道",
        "福山",
        "新倉敷",
        "岡山",
        "相生",
        "姫路",
        "西明石",
        "新神戸",
        "新大阪"
      ]
    },
    {
      "id": "tokaido",
      "name": "東海道新幹線",
      "reading": "とうかいどうしんかんせん",
      "color": "#093190",
      "track": "しんかんせん",
      "casing": "#8e999f",
      "fill": "#ffffff",
      "nozomi": ["新大阪", "京都", "名古屋", "新横浜", "品川", "東京"],
      "stations": [
        "新大阪",
        "京都",
        "米原",
        "岐阜羽島",
        "名古屋",
        "三河安城",
        "豊橋",
        "浜松",
        "掛川",
        "静岡",
        "新富士",
        "三島",
        "熱海",
        "小田原",
        "新横浜",
        "品川",
        "東京"
      ]
    },
    {
      "id": "kagoshima",
      "name": "鹿児島本線",
      "reading": "かごしまほんせん",
      "color": "#c8333a",
      "stations": [
        "博多",
        "吉塚",
        "箱崎",
        "千早",
        "香椎",
        "九産大前",
        "福工大前",
        "新宮中央",
        "ししぶ",
        "古賀",
        "千鳥",
        "福間",
        "東福間",
        "東郷",
        "赤間",
        "教育大前",
        "海老津",
        "遠賀川",
        "水巻",
        "折尾",
        "陣原",
        "黒崎",
        "八幡",
        "スペースワールド",
        "枝光",
        "戸畑",
        "九州工大前",
        "西小倉",
        "小倉"
      ]
    },
    {
      "id": "kashii",
      "name": "香椎線",
      "reading": "かしいせん",
      "color": "#2f6fd0",
      "stations": [
        "香椎",
        "和白",
        "奈多",
        "雁ノ巣",
        "海ノ中道",
        "西戸崎"
      ]
    },
    {
      "id": "kyushu",
      "name": "九州新幹線",
      "reading": "きゅうしゅうしんかんせん",
      "color": "#093190",
      "track": "しんかんせん",
      "casing": "#8e999f",
      "fill": "#ffffff",
      "express": "みずほ",
      "nozomi": ["博多", "熊本", "鹿児島中央"],
      "stations": [
        "博多",
        "新鳥栖",
        "久留米",
        "筑後船小屋",
        "新大牟田",
        "新玉名",
        "熊本",
        "新八代",
        "新水俣",
        "出水",
        "川内",
        "鹿児島中央"
      ]
    },
    {
      "id": "tohoku",
      "name": "東北新幹線",
      "reading": "とうほくしんかんせん",
      "color": "#1f8a5b",
      "track": "しんかんせん",
      "casing": "#8e999f",
      "fill": "#ffffff",
      "express": "はやぶさ",
      "nozomi": ["東京", "大宮", "仙台", "盛岡", "新青森"],
      "stations": [
        "東京",
        "上野",
        "大宮",
        "小山",
        "宇都宮",
        "那須塩原",
        "新白河",
        "郡山",
        "福島",
        "白石蔵王",
        "仙台",
        "古川",
        "くりこま高原",
        "一ノ関",
        "水沢江刺",
        "北上",
        "新花巻",
        "盛岡",
        "いわて沼宮内",
        "二戸",
        "八戸",
        "七戸十和田",
        "新青森"
      ]
    },
    {
      "id": "hokkaido",
      "name": "北海道新幹線",
      "reading": "ほっかいどうしんかんせん",
      "color": "#7a4f9e",
      "track": "しんかんせん",
      "casing": "#8e999f",
      "fill": "#ffffff",
      "express": "はやぶさ",
      "nozomi": ["新青森", "新函館北斗"],
      "stations": [
        "新青森",
        "奥津軽いまべつ",
        "木古内",
        "新函館北斗"
      ]
    },
    {
      "id": "yosan",
      "name": "予讃線",
      "reading": "よさんせん",
      "color": "#e67e22",
      "stations": [
        "坂出",
        "八十場",
        "鴨川",
        "讃岐府中",
        "国分",
        "端岡",
        "鬼無",
        "香西",
        "高松"
      ]
    },
    {
      "id": "hokuriku",
      "name": "北陸新幹線",
      "reading": "ほくりくしんかんせん",
      "color": "#b5762c",
      "track": "しんかんせん",
      "casing": "#8e999f",
      "fill": "#ffffff",
      "express": "かがやき",
      "nozomi": ["大宮", "長野", "富山", "金沢", "福井", "敦賀"],
      "stations": [
        "大宮",
        "熊谷",
        "本庄早稲田",
        "高崎",
        "安中榛名",
        "軽井沢",
        "佐久平",
        "上田",
        "長野",
        "飯山",
        "上越妙高",
        "糸魚川",
        "黒部宇奈月温泉",
        "富山",
        "新高岡",
        "金沢",
        "小松",
        "加賀温泉",
        "芦原温泉",
        "福井",
        "越前たけふ",
        "敦賀"
      ]
    },
    {
      "id": "hokurikuhon",
      "name": "北陸本線",
      "reading": "ほくりくほんせん",
      "color": "#0f6cbd",
      "stations": [
        "敦賀",
        "新疋田",
        "近江塩津"
      ]
    },
    {
      "id": "kosei",
      "name": "湖西線",
      "reading": "こせいせん",
      "color": "#29a8e0",
      "stations": [
        "近江塩津",
        "永原",
        "マキノ",
        "近江中庄",
        "近江今津",
        "新旭",
        "安曇川",
        "近江高島",
        "北小松",
        "近江舞子",
        "比良",
        "志賀",
        "蓬莱",
        "和邇",
        "小野",
        "堅田",
        "おごと温泉",
        "比叡山坂本",
        "唐崎",
        "大津京",
        "山科"
      ]
    },
    {
      "id": "kyoto",
      "name": "JR京都線",
      "reading": "じぇいあーるきょうとせん",
      "color": "#0f6cbd",
      "stations": [
        "山科",
        "京都",
        "西大路",
        "桂川",
        "向日町",
        "長岡京",
        "山崎",
        "島本",
        "高槻",
        "摂津富田",
        "JR総持寺",
        "茨木",
        "千里丘",
        "岸辺",
        "吹田",
        "東淀川",
        "新大阪",
        "大阪"
      ]
    },
    {
      "id": "kanjo",
      "name": "大阪環状線",
      "reading": "おおさかかんじょうせん",
      "color": "#e9681e",
      "loop": true,
      "stations": [
        "大阪",
        "福島（大阪）",
        "野田",
        "西九条",
        "弁天町",
        "大正",
        "芦原橋",
        "今宮",
        "新今宮",
        "天王寺",
        "寺田町",
        "桃谷",
        "鶴橋",
        "玉造",
        "森ノ宮",
        "大阪城公園",
        "京橋",
        "桜ノ宮",
        "天満"
      ]
    },
    {
      "id": "yumesaki",
      "name": "JRゆめ咲線",
      "reading": "じぇいあーるゆめさきせん",
      "color": "#1f5fae",
      "stations": [
        "西九条",
        "安治川口",
        "ユニバーサルシティ",
        "桜島"
      ]
    }
  ],
  "labels": [
    {
      "x": 3879,
      "y": 2780,
      "text": "瀬 戸 内 海",
      "size": 120,
      "color": "#84a8ad",
      "spacing": 40
    },
    {
      "x": 3442,
      "y": -319,
      "text": "芸備線は三次方面へつづく（今回は下深川まで）",
      "size": 20,
      "color": "#8e678a",
      "dx": 30,
      "dy": -45
    },
    {
      "x": -1739,
      "y": 1872,
      "text": "山口線は津和野方面へつづく",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -40,
      "dy": -95,
      "anchor": "end"
    },
    {
      "x": -1739,
      "y": 1872,
      "text": "山陽本線は下関方面・宇部線は宇部方面へつづく（今回は新山口まで）",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -40,
      "dy": -60,
      "anchor": "end"
    },
    {
      "x": 7284,
      "y": -322,
      "text": "福塩線は府中方面へつづく",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 20,
      "dy": -90
    },
    {
      "x": 9140,
      "y": -946,
      "text": "伯備線は新見方面へつづく",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -10,
      "dy": -70,
      "anchor": "end"
    },
    {
      "x": 9841,
      "y": -1306,
      "text": "山陽本線は姫路方面・赤穂線は播州赤穂方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 40,
      "dy": -130
    },
    {
      "x": 9841,
      "y": -1306,
      "text": "津山線・桃太郎線は北へつづく（今回は岡山まで）",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 40,
      "dy": -95
    },
    {
      "x": 9417,
      "y": -809,
      "text": "宇野みなと線は宇野方面へつづく",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 30,
      "dy": 40
    },
    {
      "x": 9459,
      "y": 173,
      "text": "瀬戸大橋",
      "size": 26,
      "color": "#7b8a8e"
    },
    {
      "x": 9559,
      "y": 654,
      "text": "予讃線は丸亀・松山方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -30,
      "dy": 45,
      "anchor": "end"
    },
    {
      "x": 10425,
      "y": 447,
      "text": "高徳線は徳島方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": 0
    },
    {
      "x": -6220,
      "y": 4668,
      "text": "鹿児島本線は鳥栖方面へつづく",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -40,
      "dy": 115,
      "anchor": "end"
    },
    {
      "x": -4879,
      "y": 3147,
      "text": "若松線・福北ゆたか線",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -25,
      "dy": -55,
      "anchor": "end"
    },
    {
      "x": -4096,
      "y": 3019,
      "text": "鹿児島本線は門司港方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 40,
      "dy": -60
    },
    {
      "x": -4096,
      "y": 3019,
      "text": "日豊本線は大分方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 40,
      "dy": 60
    },
    {
      "x": -6113,
      "y": 4280,
      "text": "香椎線は宇美方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 25,
      "dy": 45
    },
    {
      "x": -6638,
      "y": 4444,
      "text": "博 多 湾",
      "size": 45,
      "color": "#84a8ad",
      "spacing": 12
    },
    {
      "x": -3882,
      "y": 2641,
      "text": "関門海峡",
      "size": 30,
      "color": "#84a8ad"
    },
    {
      "x": -5898,
      "y": 5884,
      "text": "長崎本線は佐賀・長崎方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -30,
      "dy": -40,
      "anchor": "end"
    },
    {
      "x": -5852,
      "y": 6160,
      "text": "久大本線は大分方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 30,
      "dy": -30
    },
    {
      "x": -4990,
      "y": 9101,
      "text": "豊肥本線は阿蘇方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": -30
    },
    {
      "x": -6184,
      "y": 12318,
      "text": "肥薩おれんじ鉄道は海ぞいを川内へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": 0,
      "anchor": "end"
    },
    {
      "x": -5668,
      "y": 15796,
      "text": "指宿枕崎線は指宿方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -30,
      "dy": 50,
      "anchor": "end"
    },
    {
      "x": -7005,
      "y": 8217,
      "text": "有 明 海",
      "size": 45,
      "color": "#84a8ad",
      "spacing": 12
    },
    {
      "x": -6546,
      "y": 11545,
      "text": "八代海",
      "size": 40,
      "color": "#84a8ad"
    },
    {
      "x": -5030,
      "y": 16704,
      "text": "鹿児島湾",
      "size": 40,
      "color": "#84a8ad"
    },
    {
      "x": -5122,
      "y": 15789,
      "text": "桜島",
      "size": 30,
      "color": "#7b8a8e"
    },
    {
      "x": 33240,
      "y": -10493,
      "text": "上越新幹線は新潟方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": -30
    },
    {
      "x": 20098,
      "y": -6150,
      "text": "北陸本線は長浜・米原方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": 0
    },
    {
      "x": 19757,
      "y": -6733,
      "text": "小浜線は小浜方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": 40,
      "anchor": "end"
    },
    {
      "x": 18560,
      "y": -3115,
      "text": "琵琶湖線は大津・米原方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": -20
    },
    {
      "x": 18293,
      "y": -3073,
      "text": "嵯峨野線は亀岡方面・奈良線は奈良方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": -40,
      "anchor": "end"
    },
    {
      "x": 17084,
      "y": -1505,
      "text": "JR神戸線は神戸方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": -30,
      "anchor": "end"
    },
    {
      "x": 17178,
      "y": -1196,
      "text": "阪和線は和歌山方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 30,
      "dy": 40
    },
    {
      "x": 17178,
      "y": -1196,
      "text": "大和路線は奈良方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 30,
      "dy": 65
    },
    {
      "x": 17073,
      "y": -1235,
      "text": "大和路線はJR難波へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": 30,
      "anchor": "end"
    },
    {
      "x": 17262,
      "y": -1472,
      "text": "学研都市線は木津方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": -20
    },
    {
      "x": 17245,
      "y": -1300,
      "text": "近鉄は奈良方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": 0
    },
    {
      "x": 18943,
      "y": -14251,
      "text": "日 本 海",
      "size": 120,
      "color": "#84a8ad",
      "spacing": 40
    },
    {
      "x": 25373,
      "y": -13696,
      "text": "富山湾",
      "size": 40,
      "color": "#84a8ad"
    },
    {
      "x": 39879,
      "y": -18432,
      "text": "山形新幹線は山形・新庄方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": 0,
      "anchor": "end"
    },
    {
      "x": 42992,
      "y": -29238,
      "text": "秋田新幹線は秋田方面へ",
      "size": 20,
      "color": "#7b8a8e",
      "dx": -35,
      "dy": 0,
      "anchor": "end"
    },
    {
      "x": 40752,
      "y": -41459,
      "text": "北海道新幹線は札幌まで工事中",
      "size": 20,
      "color": "#7b8a8e",
      "dx": 35,
      "dy": 8
    },
    {
      "x": 42136,
      "y": -39492,
      "text": "津軽海峡",
      "size": 45,
      "color": "#84a8ad"
    },
    {
      "x": 42136,
      "y": -36441,
      "text": "陸奥湾",
      "size": 40,
      "color": "#84a8ad"
    },
    {
      "x": 39059,
      "y": -38105,
      "text": "青函トンネル",
      "size": 24,
      "color": "#7b8a8e",
      "anchor": "end"
    },
    {
      "x": 19770,
      "y": -4543,
      "text": "琵 琶 湖",
      "size": 110,
      "color": "#84a8ad",
      "spacing": 30
    },
    {
      "x": 31940,
      "y": -5153,
      "text": "富士山",
      "size": 70,
      "color": "#7b8a8e"
    },
    {
      "x": 26750,
      "y": -1658,
      "text": "浜名湖",
      "size": 45,
      "color": "#84a8ad"
    }
  ],
  "scope": "山陽新幹線 博多〜新大阪／東海道新幹線 新大阪〜東京／九州新幹線 博多〜鹿児島中央／東北新幹線 東京〜新青森／北海道新幹線 新青森〜新函館北斗／北陸新幹線 大宮〜敦賀／山陽本線 新山口〜岡山／瀬戸大橋線 岡山〜坂出／予讃線 坂出〜高松／可部線 全線／呉線 全線／岩徳線 全線／芸備線 広島〜下深川／錦川清流線 全線／鹿児島本線 博多〜小倉／香椎線 香椎〜西戸崎／北陸本線 敦賀〜近江塩津／湖西線 全線／JR京都線 山科〜大阪／大阪環状線 全線／JRゆめ咲線 全線",
  "sources": [
    {
      "title": "JR西日本 広島エリア駅ナンバー路線図",
      "url": "https://www.jr-odekake.net/station/pdf/stationnumber_hiroshima.pdf"
    },
    {
      "title": "JR西日本 岩徳線 2235D 駅順",
      "url": "https://timetable.jr-odekake.net/train-timetable/20511?date=20260710"
    },
    {
      "title": "JR西日本 呉線 区間時刻表",
      "url": "https://timetable.jr-odekake.net/line-timetable/2459?year=2026&month=7&day=26"
    },
    {
      "title": "JR西日本 山陽線 駅順（寺家・新白島含む）",
      "url": "https://www.westjr.co.jp/press/article/items/220922_00_sakematsuri.pdf"
    },
    {
      "title": "JR西日本 山陽線 徳山〜岩国 駅順",
      "url": "https://www.jr-odekake.net/eki/time_04/train/2074863.htm"
    },
    {
      "title": "JR西日本 山陽本線 区間時刻表（新山口〜徳山・三原〜岡山の駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2240"
    },
    {
      "title": "JRおでかけネット 駅情報（新南陽〜新山口の読み）",
      "url": "https://eki.jr-odekake.net/top?id=0800641"
    },
    {
      "title": "JR西日本 瀬戸大橋線・宇野みなと線 区間時刻表（岡山〜児島の駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2467"
    },
    {
      "title": "JRおでかけネット 駅情報（糸崎〜岡山・大元〜児島の読み）",
      "url": "https://eki.jr-odekake.net/top?id=0650608"
    },
    {
      "title": "JR西日本 岡山エリア駅ナンバー路線図（瀬戸大橋線の色）",
      "url": "https://www.jr-odekake.net/station/pdf/stationnumber_okayama.pdf"
    },
    {
      "title": "錦川鉄道 時刻表（令和8年3月14日改正、駅順）",
      "url": "https://nishikigawa.com/time-table/"
    },
    {
      "title": "錦川鉄道 各駅紹介",
      "url": "https://nishikigawa.com/stations/"
    },
    {
      "title": "JR西日本 沿線点描 錦川清流線 川西駅～錦町駅（行波・北河内・南桑の読み）",
      "url": "https://www.westjr.co.jp/company/info/issue/bsignal/18_vol_179/area/"
    },
    {
      "title": "ウィキデータ 各駅の座標（地図の向きの確認、CC0）",
      "url": "https://www.wikidata.org/"
    },
    {
      "title": "JR西日本 区間時刻表 新幹線（鹿児島中央〜博多〜東京）（山陽新幹線の駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2229"
    },
    {
      "title": "JRおでかけネットの各駅の駅情報（山陽新幹線の新しい12駅の読み）",
      "url": "https://eki.jr-odekake.net/top?id=0610155"
    },
    {
      "title": "JR東海 列車走行位置（東海道新幹線の駅順）",
      "url": "https://traininfo.jr-central.co.jp/shinkansen/sp/ja/ti08.html"
    },
    {
      "title": "JR東海 Maps of station layouts（東海道新幹線の駅名のローマ字・読み）",
      "url": "https://global.jr-central.co.jp/en/info/station/"
    },
    {
      "title": "JRおでかけネットの各駅の駅情報（京都・米原の読み）",
      "url": "https://eki.jr-odekake.net/top?id=0610116"
    },
    {
      "title": "JR九州 駅別時刻表 鹿児島本線（駅順）",
      "url": "https://www.jrkyushu-timetable.jp/jr-k_time/r_kagoshima.html"
    },
    {
      "title": "JR九州 駅別時刻表 香椎線（駅順）",
      "url": "https://www.jrkyushu-timetable.jp/jr-k_time/r_kashii.html"
    },
    {
      "title": "JR九州 駅情報（吉塚〜西戸崎の読み）",
      "url": "https://www.jrkyushu.co.jp/railway/station/"
    },
    {
      "title": "JR九州 駅別時刻表 鹿児島本線（九産大前〜西小倉の読み）",
      "url": "https://www.jrkyushu-timetable.jp/jr-k_time/r_kagoshima.html"
    },
    {
      "title": "JR九州 駅別時刻表 九州新幹線（博多〜鹿児島中央の駅順と読み）",
      "url": "https://www.jrkyushu-timetable.jp/jr-k_time/r_shinkansen.html"
    },
    {
      "title": "JR東日本 時刻表 東北・北海道新幹線の駅一覧（東京〜新青森の駅順と読み）",
      "url": "https://www.jreast-timetable.jp/"
    },
    {
      "title": "JR北海道 駅の情報検索（奥津軽いまべつ・木古内・新函館北斗の読みと駅順）",
      "url": "https://www.jrhokkaido.co.jp/network/station/station.html"
    },
    {
      "title": "JR東日本 時刻表 東北・山形・秋田・北海道新幹線 下り・上り（2026年10月、どの はやぶさ も止まる駅）",
      "url": "https://www.jreast-timetable.jp/2610/timetable-v/003d1.html"
    },
    {
      "title": "JR西日本 区間時刻表 瀬戸大橋線（児島〜坂出〜高松の駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2467"
    },
    {
      "title": "JR四国 駅別時刻表（坂出〜高松の読み）",
      "url": "https://www.jr-shikoku.co.jp/01_trainbus/jikoku/index.html"
    },
    {
      "title": "JR西日本 区間時刻表 北陸新幹線（東京〜高崎〜金沢〜敦賀）（北陸新幹線の駅順・かがやきの停車駅）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2829"
    },
    {
      "title": "JR東日本 時刻表 駅一覧（北陸新幹線 熊谷〜上越妙高の読み）",
      "url": "https://www.jreast-timetable.jp/"
    },
    {
      "title": "JRおでかけネット 駅情報（北陸新幹線 糸魚川〜敦賀の読み）",
      "url": "https://eki.jr-odekake.net/top?id=0541449"
    },
    {
      "title": "JR西日本 区間時刻表 北陸本線（琵琶湖線）（大阪〜京都／米原〜近江今津〜敦賀）（北陸本線・湖西線の駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2834"
    },
    {
      "title": "JR西日本 区間時刻表 琵琶湖線・JR京都線・JR神戸線（米原〜大阪〜姫路）（JR京都線の駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2234"
    },
    {
      "title": "JRおでかけネット 駅情報（湖西線・JR京都線・北陸本線の駅の読み）",
      "url": "https://eki.jr-odekake.net/top?id=0611205"
    },
    {
      "title": "JR西日本 大阪環状線 区間時刻表（駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2861"
    },
    {
      "title": "JR西日本 JRゆめ咲線 区間時刻表（駅順）",
      "url": "https://timetable.jr-odekake.net/line-timetable/2278"
    },
    {
      "title": "JRおでかけネット 駅情報（大阪環状線・JRゆめ咲線の読み）",
      "url": "https://eki.jr-odekake.net/search_free?keyword=玉造"
    }
  ],
  "checked": "2026-10-28",
  "links": [
    {
      "a": "新岩国",
      "b": "清流新岩国",
      "text": "あるいて のりかえ",
      "dx": 22,
      "dy": 8
    }
  ],
  "mapSources": [
    {
      "title": "国土数値情報（鉄道データ N02-25）国土交通省",
      "url": "https://nlftp.mlit.go.jp/ksj/gml/datalist/KsjTmplt-N02-2025.html"
    },
    {
      "title": "地球地図日本 第2.2版 国土地理院",
      "url": "https://www.gsi.go.jp/kankyochiri/gm_japan_e.html"
    }
  ]
};if(typeof module!=='undefined')module.exports=data;else r.RailRoutes=data;})(globalThis);
